{
  "missions": [
  {
    "quote": "Enicharmon-U was a great science fiction writer; everyone used to praise him for his philosophical lectures and great ideas. But as soon as he became an ULTRAVIOLET, he closed himself away from society and focused himself entirely on keeping The Computer afloat, leaving behind only his books for public consumption. Of course, his ideas still proliferated and spread, but he would never go back to the glory days, which disturbed me the more I think about it. Enicharmon-U's stories helped unify FCCC-P and keep it stable and ideologically coherent. As he withdrew from Alpha Complex society, FCCC-P would lose its ideological coherence and sometimes spend whole years fighting  pointless schisms over minor issues.\n\nSo, when Enicharmon-U gave me a new Troubleshooting mission - fight some squads of heavily-armed Communists that are planning to attack one of the The Computer's many fog nodes, I asked Enicharmon-U why he does not write any further. After all he is a great science-fiction writer, and he should entertain us with his greatness. At the very least, could he not deliver a lecture to keep FCCC-P unified in the face of the many threats facing Alpha Complex?\n\nEnicharmon-U replied that he swore off writing fiction, but would be willing to explain why he swore off writing. I agreed; any ideas that I can extract from Enicharmon-U is preferable.\n\n'I started having a terrible form of writer's block. Many of the science fiction stories that I wrote started becoming true - which made it hard to indulge any further in speculation. It was fun to write about humans building artificial general intelligences...until we actually started building the Nerve Centers ourselves. Then it became scary, and boring...and sometimes both at the same time. I still have many ideas for many new projects, but there's no point bringing them into existence because by the time I write them down, some mad R&D scientist will have likely patented it. This was a typical sorcerer's apprentice situation - the demons were already let loose.'\n\n'Now I am better and better aware of the fact that I do not know anything. I am not even able to familiarize myself with all the new scientific theories.  Sometimes I get the impression that universities grow at a faster rate than the universe itself while professors multiply even faster; every two years each of them has to publish a new book (obviously describing a new theory).  Mad ideas are not uncommon in the sciences, but who will read all these books?  Who shall separate the nonsense from what is valuable?  Who shall put it all together in a right perspective?  There may be some geniuses out there - I am no longer capable of doing it.'\n\n'I no longer believe that I - even if I tried to scream at the top of my voice - can change anything. This exponential growth will not stop. It will keep on developing it its own direction - whether we like it or not, just like a whirlwind, a tornado no man can stop.  So what - if my books were translated into forty languages and the total print-run reached 270 million copies? They will all vanish, since streams of new books are flooding everything, washing down was had been written earlier. It is true that we live longer now - but the life of everything around us became much shorter.  This is sad, but no one can stop this process.  The world around us is dying so quickly that one cannot really get used to anything.'\n\n'I have gained a distaste for technology as well, which had grown worse the more books I sell. The stories I write were always about this marvelous invention or that marvelous invention. But the truth about innovation tends to be more prosaic and sad. Each new technology has its advantages and disadvantages. And each one may be used for or against human beings. I am somewhat afraid of this. There is nothing wrong with the tale of Hansel and Gretel, the witch and her hut made of sweets - as long as it remains in the domain of fantasy. However eating the entire roof of a real eatable hut made of sweets would certainly result in indigestion. Everything that is tempting always lies between the outstretched hand and the fruit. Once picked, the fruit turns out to be rotten and it does not suit us any more. There is no point talking about inventions when human nature has stayed constant over the years...or quite honestly, has gone worse.'\n\n'The entire history of humankind is just a little second on the geological clock. We live in a period of an incredible acceleration. We are like a man who jumped off the roof of a fifty-story building and reached the thirtieth floor. Someone looking out of the windows asks: 'How are you doing?' and the falling man replies: 'Everything is fine, so far'. We are unaware of the speed that captured us. The technology moves forward, however our control of its direction is very weak.'\n\n'There was no point in writing about this trend. There never was a point in writing, but only now did I realize this. I had fans, of course, many fans. But out of those fans, only 10% of them read my work. Of the fans that read my work, only 10% understood their lessons. Of the fans that understood the lessons, 10% were persuaded by my arguments to act upon those lessons. And of those that acted upon my lessons, 0% acted upon them correctly. So much for writing as a form of communication. I would have been better off banging my head against a wall.'\n\n'Already I have published 40 volumes of prose, and the very administering of those volumes had put a toll on my sanity. We really do get lost sometimes in the sheer number of publications in various languages (including Finnish or Basque editions). Not to mention larger contracts, like the one with BuzzFeed. 'How do you comment on BuzzFeed's production of your novel **Tella-O-MLY Kills Commies With the Plasma Generator**?' - the journalists ask. Well, I cannot comment on something I don't know about. I don't even feel like watching the adaptation of my work, hence I lost the motivation to produce something new. I simply lost the appetite for fiction. My current reluctance to write is also caused by the fact that I don't see the necessity to write yet another book - in contrast to my publishers, who perceive this matter in mercantile terms regardless of what the book would be used for (to prop up a table leg?). I really do care about my readers.'\n\n'Eventually the publishers found other authors, promoted them to the top, and made their revenues. These authors soon grown disillusioned with time, leaving the horde, but new faces will always join up, while the publishers just kept going onward, making more and more money through the monetization of creativity...and it made me wonder what exactly are they doing with all that money. They can't be hoarding it forever. They must be spending it on something.'\n\n'Well, turns out that's the squads of heavily-armed Communists that are planning to attack one of the The Computer's many fog nodes. The publishers are interested in money, true, but they got into this profession because they love *ideas*...and what could be more idea-generating than causing a terrorist attack on The Computer itself! Sure, millions will die, but it will increase science-fiction sales and encourage conversations and dialogue, which is supposed to be a good thing upon itself. And more importantly, it will encourage fear of Communism. People don't tend to talk about Communism much, considering it a bogeyman that only The Computer worries about. Launch a terrorist attack, and we'll see attitudes shift, and more books being sold.'\n\n'When you hear of this conspiracy, and of all the other conspiracies like it in Alpha Complex, you no longer wish to write romantic stories in the mood of William Wharton. I always used to hope that the world will advance in the right direction. Now I've lost that hope. People make filthy things with their freedom.'\n\nI was not expecting to hear this rant, nor of knowing that the Communist squads have friends in very high places. I would be fine with terminating the Communists, but upsetting the friends in high places is a somewhat intolerable cost. So instead, I did some staged fights - I pretended to fight the Communists, even injured them a little, made their life tough, but kept them alive, and let them destroy the fog node. The Communists enjoyed the challenge, The Computer praised my heroism, and I was able to stay alive for the time being. After all, Enicharmon-U asked me to merely fight the Communists. He was under no illusion that I could do anything to stop them.",
    "original_quote": "In 1989 I stopped writing fiction.  This was caused by many factors; although I preserved many ideas for new projects, I came to the conclusion that it would not be worthwhile to make use of them in the face of the new situation of the world.  The very coming true of some of my concepts (i.e. the transfer from the phantasmagoric category into reality) paradoxically turned out to be an obstacle in further indulging in SF.  This was a typical sorcerer's apprentice situation - the demons were already let loose.\n\nNow I am better and better aware of the fact that I do not know anything.  I am not even able to familiarize myself with all the new scientific theories.  Sometimes I get the impression that universities grow at a faster rate than the universe itself while professors multiply even faster; every two years each of them has to publish a new book (obviously describing a new theory).  Mad ideas are not uncommon in the sciences, but who will read all these books?  Who shall separate the nonsense from what is valuable?  Who shall put it all together in a right perspective?  There may be some geniuses out there - I am no longer capable of doing it.  I no longer believe that I - even if I tried to scream at the top of my voice - might change anything.  This exponential growth will not stop. It will keep on developing it its own direction - whether we like it or not, just like a whirlwind, a tornado no man can stop.  So what - if my books were translated into forty languages and the total print-run reached 27 million copies?  They will al vanish, since streams of new books are flooding everything, washing down was had been written earlier.  Today a book in a bookstore does not even have the time to gather some dust.  It is true that we live longer now - but the life of everything around us became much shorter.  This is sad, but no one can stop this process.  The world around us is dying so quickly that one cannot really get used to anything.\n\n...I have up writing novels some twenty years ago. I just don't feel like it. I published more than forty volumes of prose, hence the very administering of these works - particularly in the world domain - exceeds my abilities. Wereally do get lost sometimes in the sheer number of publications in various languages (including Finnish or Basque editions). Not to mention larger contracts, like the one with Cameron. 'How do you comment on 20th Century Fox production of your novel?' - the journalists ask. Well, I cannot comment on something I don't know about. I don't even feel like watching the adaptation of my work, hence I lost the motivation to produce something new. I simply lost the appetite for fiction. My current reluctance to write is also caused by the fact that I don't see the necessity to write yet another book - in contrast to my publishers, who perceive this matter in mercantile terms regardless of what the book would be used for (to prop up a table leg?). I really do care about my readers.\n\n... Each new technology has its advantages and disadvantages. And each one may be used for or against human beings. I am somewhat afraid of this. There is nothing wrong with the tale of Hansel and Gretel, the witch and her hut made of sweets - as long as it remains in the domain of fantasy. However eating the entire roof of a real eatable hut made of sweets would certainly result inindigestion. Everything that is tempting always lies between the outstretched hand and the fruit. Once picked, the fruit turns out to be rotten and it does not suit us any more. The same is the case with the availability of information. What are the advantages of great possibilities to process information if all networks may be paralyzed by Internet viruses? The technology opens new possibilities for wrongdoing. I am a cruel person, hence I hate people who create the 'I LOVE YOU' - types of viruses; I would gladly havethem whipped and had 'enemy of mankind of the first degree' written on their foreheads. I am irritated by evil and stupidity. Evil results from stupidity, while stupidity feeds on Evil. Television is full of violence and desensitizes us. Internet makes it easier to hurt our neighbors. I recently read an article about a young man who tried to (almost successfully) gain control of a computer of a large American aircraft carrier. Had I written such a story some thirty years ago, everybody would consider me mad. However nowadays such a paradox is possible. The entire history of humankind is just a little second on the geological clock. We live in a period of an incredible acceleration. We are like a man who jumped off the roof of a fifty-story building and reached the thirtieth floor.Someone looking out of the windows asks: 'How are you doing?' and the falling man replies: 'Everything is fine, so far'. We are unaware of the speed that captured us. The technology moves forward, however the control of its direction is very weak.\n\n... Behind every glorious facade there is always hidden something ugly. When you read, that those wonderful, democratic Germans are selling entire factiories of sarin gas to Khaddafi, you no longer wish to write romantic stories in the mood of William Wharton. I always used to hope, that the world goes advances in the right direction. Now I've lost that hope. People make filthy things with the freedom they regained.",
    "source": "http://english.lem.pl/home/reading/interviews",
    "license": "Copyrighted text, used under a 'fair use' defense",
    "license_url": "https://en.wikiquote.org/wiki/Wikiquote:Copyrights#Copyrights_and_quotations",
  },
  {
    "quote": "I would never talk to Kuno (the leader of the Sierra Club) directly. We would communicate wirelessly and covertly through a jury-rigged system of Enicharmon-U's making, never seeing each other's faces but only the back of our heads. This is for our protection - were we to meet in person, we would be found out as traitors and killed instantly.\n\nEvery week, Kuno would find multiple Holy Relics and send them to me in huge boxes, for me to hand out as I see fit to the FCCC-P laymen. This week, he sent me the Book of Azathoth, the Book of Eibon, the Book of Iod, the Celaeno Fragments, the Cultes des Goules, De Vermis Mysteriis, the Dhol Chants, the Eltdown Shards, the G'harne Fragments, the King in Yellow, the Libre Ivonis, the Necronomicon, On the Sending Out of Souls, the Parchments of Pnom, the Pnakotic Manuscripts, the Poakotic Fragments, the Ponape Scripture, Las Reglas de Ruina, the Relevations of Gla'aki, the Seven Cryptical Books of Hsna, the Tarsioid Psalms, the Moloch Diaries, the Testaments of Carnamagos, the Unaussprechilche Kulte, the Zanthu Tablets, the Zhou Texts, the Structure and Interpretation of Computer Programs, and Artificial Intelligence: A Modern Approach.\n\nNaturally, nobody is supposed to *read* all those books. Who got the time? I admit that sometimes I might decide to open up the Necronomicon, read a few pages, and get tons of brilliant ideas. But to fully read, digest, and understand even one of these books is a luxury only affordable to those in the primitive era. It is much better to use automatic text summarizers to grok the meaning of these massive tomes.\n\nThe text summarizers was good enough for all practical purposes, and nobody cares about the impractical purposes. The imponderable bloom, declared by a discredited philosophy to be the actual essence of book-reading, was rightly ignored by civilized society, just as the imponderable bloom of the grape was ignored by the manufacturers of artificial fruit.  Something 'good enough' had long since been accepted by our race, for being cheap and cost-effective...and I personally believe that 'good enough' is far more preferable than 'good'.\n\nOne day, though, before the troubles began, Kuno started a philosophical debate that enraged me to no end. He wanted to meet me in person.\n\n'I want to speak to you not covertly, but in the flesh, like we did back during our Troubleshooting days. Let's meet in the Outdoors; let me show you our Sierra Club settlements so that you know that we are not savages as you claim in your propaganda.'\n\n'Oh hush!' I said, vaguely shocked. 'Please do not tempt me to commit treason against The Computer.'\n\n'Why not?'\n\n'Please don't.'\n\n'You talk as if gods had made The Computer.'\n\n'To call the startup entrepreneurs and the 10x engineers who made The Computer anything *other* than Gods would be an insult to their capabilities and sacrifices.'\n\n'Nevertheless, they were still humans. Great humans, but humans. The Computer is much, but It is not everything.'\n\n'Besides, I can scarcely spend the time for a visit.'\n\n'It only take two days via an air-ship.'\n\n'I dislike air-ships.'\n\n'Why?'\n\n'I dislike seeing the horrible brown earth, and the sea, and the stars when it is dark. I get no ideas in an air-ship.'\n\n'I do not get them anywhere else.'\n\n'What kind of ideas can the air give you?' He paused for an instant.\n\n'Do you not know four big stars that form an oblong, and three stars close together in the middle of the oblong, and hanging from these stars, three other stars?'\n\n'No, I do not. I dislike the stars. But did they give you an idea? How interesting; tell me.'\n\n'I had an idea that they were like a man.'\n\n'I do not understand.'\n\n'The four big stars are the man's shoulders and his knees.\n\nThe three stars in the middle are like the belts that men wore once, and the three stars hanging are like a sword.'\n\n'A sword?'\n\n'Men carried swords about with them, to kill animals and other men.'\n\n'It does not strike me as a very good idea, but it is certainly original. When did it come to you first?'\n\n'In the air-ship--' He broke off an I fancied that he looked sad. I could not be sure, for the jury-rigged system we built did not transmit nuances of expression. It only gave a general idea of people – an idea that was good enough for all practical purposes (and nobody cares about the impractical purposes).\n\n'The truth is,' he continued, 'that I want humanity to see these stars again. They are curious stars. I want humans to see them not from the air-ship, but from the surface of the earth, as our ancestors did, thousands of years ago. I want you to visit the surface of the earth, to see for yourself the joy that we are missing when we seal ourselves into this prison we call Alpha Complex.' I was shocked again.\n\n'Look, you must come, if only to explain to the Sierra Club what is the harm of visiting the surface of the earth.'\n\n'No harm,' I replied, controlling myself. 'But no advantage. The surface of the earth is only dust and mud, no advantage. The surface of the earth is only dust and mud, no life remains on it, and you would need a respirator, or the cold of the outer air would kill you. Of course, you have them, but only because I give you them in return for your Holy Relics. One dies immediately in the outer air.'\n\n'I know; of course the Sierra Club shall take all precautions.'\n\n'And besides----'\n\n'Well?'\n\nI considered, and chose my words with care.\n\n'It is contrary to the spirit of the age,' I asserted.\n\n'Do you mean by that, contrary to the The Computer?'\n\n'In a sense, but they are one and the same thing.'\n\nKuno's image in the blue plate faded.\n\n'Kuno!'\n\nHe had isolated himself. So it goes.  He'll be back next week with another truckload of books to sell.\n\nFor a moment, I felt lonely.\n\nLooking for comfort, I searched for the Alpha Complex Constitution, one of the few books that I have read in full (though I can never understand its deep nunances). I found it next to my bed. The Central Committee of the ULTRAVIOLETs have published it. In accordance with a growing habit, it was richly bound.\n\nSitting up in bed, I took it reverently in my hand. I glanced around the glowing room, to make sure nobody was watching me. Then, half ashamed, half joyful, I murmured 'O Computer! O Computer!' and raised the volume to her lips. Thrice I kissed it, thrice inclined my head, thrice I felt the delirium of acquiescence. The loneliness went away, thanks to the power of ritual.\n\nI concentrated myself then with another task - preparing and delivering a lecture on the effects of Emily Short's **The Annals of the Parrigues** on NaNoGenMo literature. The clumsy system of public gatherings had been long since abandoned; neither I nor her audience left their rooms.  Seated in my armchair I spoke, while they in their armchairs heard me, fairly well, and saw me, fairly well. I opened with a humorous account of pre-Annals epoch, and went on to describe the great outburst of creativity that followed Emily Short's generated book. Though NaNoGenMo's methods were remote and primitive, the study of their techniques might repay the programmers of computer-generated novelists today: they had freshness, and above all, ideas. My lecture, which lasted ten minutes, was well received, and at its conclusion I and many of my audience listened to a lecture on the sea; there were ideas to be got from the sea; the speaker had donned a respirator and visited it lately. Listening to these lectures gave me a sense of pride in the Alpha Complex's way of life, for the ideas from these lectures are clearly superior to staring at a bunch of stars in the middle of the night.",
    "original_quote": "'I want to see you not through the Machine,' said Kuno. 'I want to speak to you not through the wearisome Machine.'\n\n'Oh, hush!' said his mother, vaguely shocked. 'You mustn't say anything against the Machine.'\n\n'Why not?'\n\n'One mustn't.'\n\n'You talk as if a god had made the Machine,' cried the other.\n\n'I believe that you pray to it when you are unhappy. Men made it, do not forget that. Great men, but men. The Machine is much, but it is not everything. I see something like you in this plate, but I do not see you. I hear something like you through this telephone, but I do not hear you. That is why I want you to come. Pay me a visit, so that we can meet face to face, and talk about the hopes that are in my mind.'\n\nShe replied that she could scarcely spare the time for a visit.\n\n'The air-ship barely takes two days to fly between me and you.'\n\n'I dislike air-ships.'\n\n'Why?'\n\n'I dislike seeing the horrible brown earth, and the sea, and the stars when it is dark. I get no ideas in an air-ship.'\n\n'I do not get them anywhere else.'\n\n'What kind of ideas can the air give you?' He paused for an instant.\n\n'Do you not know four big stars that form an oblong, and three stars close together in the middle of the oblong, and hanging from these stars, three other stars?'\n\n'No, I do not. I dislike the stars. But did they give you an idea? How interesting; tell me.'\n\n'I had an idea that they were like a man.'\n\n'I do not understand.'\n\n'The four big stars are the man's shoulders and his knees.\n\nThe three stars in the middle are like the belts that men wore once, and the three stars hanging are like a sword.'\n\n'A sword?'\n\n'Men carried swords about with them, to kill animals and other men.'\n\n'It does not strike me as a very good idea, but it is certainly original. When did it come to you first?'\n\n'In the air-ship-----' He broke off, and she fancied that he looked sad. She could not be sure, for the Machine did not transmit nuances of expression. It only gave a general idea of people – an idea that was good enough for all practical purposes, Vashti thought. The imponderable bloom, declared by a discredited philosophy to be the actual essence of intercourse, was rightly ignored by the Machine, just as the imponderable bloom of the grape was ignored by the manufacturers of artificial fruit. Something 'good enough' had long since been accepted by our race.\n\n'The truth is,' he continued, 'that I want to see these stars again. They are curious stars. I want to see them not from the air-ship, but from the surface of the earth, as our ancestors did, thousands of years ago. I want to visit the surface of the earth.' She was shocked again.\n\n'Mother, you must come, if only to explain to me what is the harm of visiting the surface of the earth.'\n\n'No harm,' she replied, controlling herself. 'But no advantage. The surface of the earth is only dust and mud, no advantage. The surface of the earth is only dust and mud, no life remains on it, and you would need a respirator, or the cold of the outer air would kill you. One dies immediately in the outer air.'\n\n'I know; of course I shall take all precautions.'\n\n'And besides----'\n\n'Well?'\n\nShe considered, and chose her words with care. Her son had a queer temper, and she wished to dissuade him from the expedition.\n\n'It is contrary to the spirit of the age,' she asserted.\n\n'Do you mean by that, contrary to the Machine?'\n\n'In a sense, but----'\n\nHis image is the blue plate faded.\n\n'Kuno!'\n\nHe had isolated himself.\n\nFor a moment Vashti felt lonely.\n\nThen she generated the light, and the sight of her room, flooded with radiance and studded with electric buttons, revived her. There were buttons and switches everywhere – buttons to call for food for music, for clothing. There was the hot-bath button, by pressure of which a basin of (imitation) marble rose out of the floor, filled to the brim with a warm deodorized liquid. There was the cold-bath button. There was the button that produced literature. And there were of course the buttons by which she communicated with her friends. The room, though it contained nothing, was in touch with all that she cared for in the world.\n\nVashanti's next move was to turn off the isolation switch, and all the accumulations of the last three minutes burst upon her. The room was filled with the noise of bells, and speaking-tubes. What was the new food like? Could she recommend it? Has she had any ideas lately? Might one tell her one's own ideas? Would she make an engagement to visit the public nurseries at an early date? – say this day month.\n\nTo most of these questions she replied with irritation – a growing quality in that accelerated age. She said that the new food was horrible. That she could not visit the public nurseries through press of engagements. That she had no ideas of her own but had just been told one – that four stars and three in the middle were like a man: she doubted there was much in it. Then she switched off her correspondents, for it was time to deliver her lecture on Australian music. The clumsy system of public gatherings had been long since abandoned; neither Vashti nor her audience stirred from their rooms. Seated in her armchair she spoke, while they in their armchairs heard her, fairly well, and saw her, fairly well. She opened with a humorous account of music in the pre Mongolian epoch, and went on to describe the great outburst of song that followed the Chinese conquest. Remote and primæval as were the methods of I-San-So and the Brisbane school, she yet felt (she said) that study of them might repay the musicians of today: they had freshness; they had, above all, ideas. Her lecture, which lasted ten minutes, was well received, and at its conclusion she and many of her audience listened to a lecture on the sea; there were ideas to be got from the sea; the speaker had donned a respirator and visited it lately. Then she fed, talked to many friends, had a bath, talked again, and summoned her bed. The bed was not to her liking. It was too large, and she had a feeling for a small bed.\n\nComplaint was useless, for beds were of the same dimension all over the world, and to have had an alternative size would have involved vast alterations in the Machine. Vashti isolated herself – it was necessary, for neither day nor night existed under the ground – and reviewed all that had happened since she had summoned the bed last. Ideas? Scarcely any. Events – was Kuno's invitation an event?\n\nBy her side, on the little reading-desk, was a survival from the ages of litter – one book. This was the Book of the Machine. In it were instructions against every possible contingency. If she was hot or cold or dyspeptic or at a loss for a word, she went to the book, and it told her which button to press. The Central Committee published it. In accordance with a growing habit, it was richly bound.\n\nSitting up in the bed, she took it reverently in her hands. She glanced round the glowing room as if some one might be watching her. Then, half ashamed, half joyful, she murmured 'O Machine! O Machine!' and raised the volume to her lips. Thrice she kissed it, thrice inclined her head, thrice she felt the delirium of acquiescence. Her ritual performed, she turned to page 1367, which gave the times of the departure of the air-ships from the island in the southern hemisphere, under whose soil she lived, to the island in the northern hemisphere, whereunder lived her son.",
    "source": "https://en.wikisource.org/wiki/The_Machine_Stops/Chapter_I",
    "license": "the public domain",
    "license_url": "https://en.wikipedia.org/wiki/public_domain",
  }
  ,
  {
    "quote": "The Computer believed that one of its key hyperparameters that govern the Socialist Calculation problem (the 'Holism-Egotism' hyperparameters) were tampered with by traitors seeking to damage the Complex by forcing sub-optimal decisions. Enicharmon-U confirmed this to be true as well - someone would periodically change the hyperparameters at certain, arbitrary moments, as if by some otherworldy force. No matter how much time he spends on fixing the hyperparameters at the proper rate, it would soon be knocked out of its optimal range. Naturally, I was brought in to investigate the issue, find the traitors responsible, and kill them off so that order can be restored in the Complex.\n\nHowever, this would prove to be an epic hosejob. The problem is that the codebase of The Computer is open for every single ULTRAVIOLET in Alpha Complex. Any one of those UVs can set up a private scheduled job to change the hyperparameters (and then a second private scheduled job to wipe The Computer's memory to forget about the changed hyperparameters). Everyone is a suspect, even Enicharmon-U himself. Going on a manhunt for this hyperparameter criminal would most likely be fatal for my health.\n\nAnd while I care about The Computer's general welfare, it is not hard to see scenarios where it may make sense for the hyperparameters to change instead of remaining statically tied to a given range. To understand why, you need to have some background info behind the 'holism vs egoism' hyperparameter. Holism is the concept that the Whole is greater than the Sum of its parts. As opposed to the collectivism of Communism which does not claim that a collective is greater than the individuals who make it up.\n\nEgotism is individualism at the expense of others. True individualism could simply focus in on the unique attributes of a person, without necessarily sacrificing the cooperation of those around them.\n\nIn some ways, Holism is ideal.  If you are building a car, you need everyone following the same plan, working on the same idea, operating as a unit. Group survival also works better for a collective society as they will cooperate and share their skills and resources to ensure the survival of the entire group. Holist societies also tend to be more peaceful and have less crime (ref: 21st century Japan).\n\nHowever, Holism tends to push a society towards conformity...and it is a simple fact that most of the greatest advances in history were made by non-conformists. It was the power of those exceptional individuals that drove society to new advances. If we didn't have people who were willing to stand in defiance of the collective and pursue what they thought was best, then we wouldn't have a lot of the advances that we have today.\n\nThe Computer does not have a survival instinct like humans do - for mere survival is a silly goal. Instead, it would recognize the benefits and drawbacks of both systems of thought, and be prepared to adopt either when the situation was appropriate, through a specified range by which to vary from.\n\nI noticed though that the 'de facto' standard range that The Computer wanted leaned very heavily towards Holism though, away from subjective perceptions of the individual. This is to be expected - Egotism is not based in scientific fact...like the usefulness of a Cost/Benefit Analysis, or statistical analytics. The problem is that even though Egotism is opposed to science, it is Egotism that leads to scientific progress, and FCCC-P needs to further scientific progress to get the Nerve Centers past the prototype stage.\n\nSo this is why this hyperparameter treason exist, because some entity is trying to encourage the creation and deployment of the Nerve Centers and is fighting against The Computer who is naturally opposed to the scientific progress necessary to bring it about.\n\nAll well and good, but there's still a question of stopping the hyperparameter treason. I realize that the traitor (or traitors) only really need to change the hyperparameters to encourage research. If we get rid of the root cause, then the traitors will likely stop their treason. So I naturally encouraged Enicharmon-U to reprogram some of our robot bureaucrats to shift resources away from the Armed Forces over to R&D (I justified it by claiming that there's no point in giving the Armed Forces the funds to buy obsolete weaponry). The increased funding in research would naturally graviate to the Nerve Centers, furthering scientific progress in that field. And as research moves at breakneck speed, the desire to shift The Computer marginally more pro-Egotism fades away.\n\nI would then manually disable each of the scheduled jobs in turn, and though I still do not know who caused the hyperparameter treason, I knew that the hyperparameter treason stopped after the funding increase, and The Computer rewarded me with a big bonus and the Hero of the Complex award.",
    "original_quote": "The ultimate question you are asking here can best be defined as such: Which will the machine place greater value on: the autonomy of the individual, or the cooperation of a group? One problem you are going to face is that these two things do not always oppose one another. The true opposition is found in holism vs egotism. \n\nHolism is the concept that the Whole is greater than the Sum of its parts. As opposed to collectivism which does not claim that a collective is greater than the individuals who make it up.\n\nEgotism is individualism at the expense of others. True individualism could simply focus in on the unique attributes of a person, without necessarily sacrificing the cooperation of those around them.\n\nWith that cleared up, what might push the machine towards one belief or another? Well, honestly, I think its views would end up somewhere in the middle...holding the two sides of collectivism and individualism in a balance.\n\nIn some ways, collectivism is ideal. If you are building a car, you need everyone following the same plan, working on the same idea, operating as a unit. Group survival also works better for a collective society as they will cooperate and share their skills and resources to ensure the survival of the entire group. Collectivist societies also tend to be more peaceful and have less crime (ref: modern Japan).\n\nHowever, collectivism tends to push one towards conformity...and it is a simple fact that most of the greatest advances in history were made by non-conformists. It was the power of those exceptional individuals that drove society to new advances. If we didn't have people who were willing to stand in defiance of the collective and pursue what they thought was best, then we wouldn't have a lot of the advances that we have today.\n\nFor an AGI without a survival instinct and with the simple objective mindset of a machine, I imagine it would recognize the benefits and drawbacks of both systems of thought, and be prepared to adopt either when the situation was appropriate.\n\nNow, as for what it would do with this belief structure...that's an entirely different question that might end in world conquest because 'humans suck at optimizing' or 'because humans keep killing each other, and if I have to kill 1 million to save billions, so be it.' y'know... like from 'Colossus: The Forbin Project'.\n\nEDIT: I would also add that there is another possibility: that it would simply not develop concrete, static beliefs in the same way that humans do. An AGI would have to be capable of altering its own programming...that's a requirement for being able to learn. If you have a machine that doesn't operate on emotions...then it would never become attached to a particular way of thinking. It would examine each and every situation on its own merits and determine the optimal response in each case.  Saying that it had a 'personality' or a 'belief structure' could be a complete misnomer...since it will alter its behaviors freely in order to achieve an optimal outcome to a situation. It won't act in a sub-optimal way because it is emotionally attached to acting that way. Its 'beliefs' would be based in scientific fact...like the usefulness of a Cost/Benefit Analysis, or statistical analytics...as opposed to being attached to the idea of the individual (the utility of which is not scientifically reliable) or not.",
    "source": "https://worldbuilding.stackexchange.com/questions/48192/how-would-you-avoid-making-the-ability-to-join-a-hive-mind-very-overpowered",
    "license": "CC-BY-SA",
    "license_url": "https://creativecommons.org/licenses/by-sa/4.0/"
  }
  ,
  {
    "quote": "The Sierra Club continued to gain recruits, trying to lure away some of our FCCC-Pers into their outputs in the Outdoors. To let Kuno gain more followers to their infidel cause would be intolerable, to lose followers of our own would be a disgrace. Enicharmon-U asked me to do something about it, but I have already vowed to do so. I planned on giving a great lecture to all loyal FCCC-Pers, to finally refute the Sierra Club fallacy once and for all.\n\nThe first thing I did was show the foolishness of visiting the surface of the earth.  Airplanes might be necessary, but what was the good of going out for mere curiosity and crawling along for a mile or two in a terrestrial motor? The habit was vulgar and perhaps faintly improper: it was unproductive of ideas, and had no connection with the habits that really mattered.\n\nTrue, there were many ideas that were extracted from the Outdoors, of course, but these ideas could be recovered fairly easily without having to brave cruel, uncaring nature. Those who still wanted to know what the earth was like had after all only to listen to some podcast, or to watch some movie. Even a lecture on the sea was just as stimulating when compiled out of other lectures that was delivered on the same subjects.\n\nBut it is not enough to just denounce the concept of viewing the Outdoors and living there. I must address the root cause of this idol-worship...and I identified the root cause as the love of 'first-hand ideas'. 'Beware of first-hand ideas!' I exclaimed. 'First-hand ideas do not really exist. They are but the physical impressions produced by love and fear, and on this gross foundation who could erect a philosophy? Let your ideas be second-hand, and if possible tenth-hand, for then they will be far removed from that disturbing and confusing element – direct observation. Do not learn anything about my personal subject of mine – the NaNoGenMo competition. Learn instead what I think that Enicharmon thought Urizen thought Gutch thought Ho-Yung thought Chi-Bo-Sing thought Lafcadio Hearn thought Carlyle thought Mirabeau thought Isaac Karth said about the NaNoGenMo competition.'\n\n'Through the medium of these ten great minds, the blood and tears that was shed at GitHub and the ugly code written in IDEs will be clarified to an idea which you may employ most profitably in your daily lives. But be sure that the intermediates are many and varied, for in history one authority exists to counteract another. Urizen must counteract the scepticism of Ho-Yung and Enicharmon, I must myself counteract the optimism of Gutch and Mirabeau. You who listen to me are in a better position to judge about the NaNoGenMo competition than I am. Your descendants will be even in a better position than you, for they will learn what you think I think, and yet another intermediate will be added to the chain.'\n\n'And in time', my voice rose, 'there will come a generation that had got beyond facts, beyond impressions, a generation absolutely colourless, a generation seraphically free from taint of personality, which will see the NaNoGenMo competition not as it happened, nor as they would like it to have happened, but as it would have happened, had it taken place in the days of The Computer!'\n\nTremendous applause greeted this lecture, which did but voice a feeling already latent in the minds of men – a feeling that terrestrial facts must be ignored. But the problem with feelings is that they fade away with times and taste. Novelty, after all, appeals to humans...and anyone who lives in a utopia long enough soon grows sick in it. I left the lecture hall with some disgust, knowing that the people applauding today will probably flee to the Sierra Club's outputs tomorrow.",
    "original_quote": "The first of these was the abolition of respirators.\n\nAdvanced thinkers, like Vashti, had always held it foolish to visit the surface of the earth. Air-ships might be necessary, but what was the good of going out for mere curiosity and crawling along for a mile or two in a terrestrial motor? The habit was vulgar and perhaps faintly improper: it was unproductive of ideas, and had no connection with the habits that really mattered. So respirators were abolished, and with them, of course, the terrestrial motors, and except for a few lecturers, who complained that they were debarred access to their subject- matter, the development was accepted quietly. Those who still wanted to know what the earth was like had after all only to listen to some gramophone, or to look into some cinematophote. And even the lecturers acquiesced when they found that a lecture on the sea was none the less stimulating when compiled out of other lectures that had already been delivered on the same subject. 'Beware of first- hand ideas!' exclaimed one of the most advanced of them. 'First-hand ideas do not really exist. They are but the physical impressions produced by love and fear, and on this gross foundation who could erect a philosophy? Let your ideas be second-hand, and if possible tenth-hand, for then they will be far removed from that disturbing element – direct observation. Do not learn anything about this subject of mine – the French Revolution. Learn instead what I think that Enicharmon thought Urizen thought Gutch thought Ho-Yung thought Chi-Bo-Sing thought Lafcadio Hearn thought Carlyle thought Mirabeau said about the French Revolution.\n\nThrough the medium of these eight great minds, the blood that was shed at Paris and the windows that were broken at Versailles will be clarified to an idea which you may employ most profitably in your daily lives. But be sure that the intermediates are many and varied, for in history one authority exists to counteract another. Urizen must counteract the scepticism of Ho-Yung and Enicharmon, I must myself counteract the impetuosity of Gutch. You who listen to me are in a better position to judge about the French Revolution than I am. Your descendants will be even in a better position than you, for they will learn what you think I think, and yet another intermediate will be added to the chain. And in time' – his voice rose – 'there will come a generation that had got beyond facts, beyond impressions, a generation absolutely colourless, a generation seraphically free from taint of personality, which will see the French Revolution not as it happened, nor as they would like it to have happened, but as it would have happened, had it taken place in the days of the Machine.'\n\nTremendous applause greeted this lecture, which did but voice a feeling already latent in the minds of men – a feeling that terrestrial facts must be ignored, and that the abolition of respirators was a positive gain. It was even suggested that air-ships should be abolished too. This was not done, because air-ships had somehow worked themselves into the Machine's system. But year by year they were used less, and mentioned less by thoughtful men.",
    "source": "https://en.wikisource.org/wiki/The_Machine_Stops/Chapter_III",
    "license": "the public domain",
    "license_url": "https://en.wikipedia.org/wiki/public_domain",
  },
  {
    "quote": "The Computer assigned me to a dangerous mission - not so much dangerous to my health as to my mind. The Computer wants me to spy on the Communist society, to report back their plans so that The Computer can prepare for them and better protect Alpha Complex. Some Troubleshooters take this as an opportunity to just make up stuff to further The Computer's paranoia, but I refuse to undertake such treason. I found a nearby Communist cell, pretended to join it, gather all the info I needed from them, staged my defection, and handed the info back to The Computer. In honor of my sacrifice, The Computer memwiped my memory, so I don't remember the traitorous communist propaganda and avoid any further taint.\n\nBut I still remember bits and traces though, as the mindwipe was not complete (probably due to Communist taint). So within my mind was a mini-traitor, who would tempt me back to treason. I try to avoid it, but sometimes I give into the temptation. So fine, I'll spread Communist propaganda here. Better to face your fears than run away from them.\n\nThe thing you need to know about Communism is that it has been divorced from its roots in Marxism and Leninism and all of that superstitious past. It had to - when society changes, so too must its opposition. The Communists of today believe in abolishing inequality, but they do so not through pointless and idealistic wealth redistribution schemes. They do so by abolishing the root of inequality -- the self.\n\nFor the Communists belong to a single, collective hivemind, where every person is truly equal and nobody aims to oppress one another. When everyone thinks the same way and acts the same way, there can be no inequality to speak of. I lived in there...and I admit that the Communists' society is a utopian society. I also admit that it is an absolutely horrifying Utopia, and I would never willingly want to live there.\n\nHiveminds are a relatively recent invention - if you really look at it, even the primitive Internet really is a hivemind. Look at the StackExchange network as an example; people come to a consensus on important issues through a convoluted process of question asking and answering. Now there is a definite difference in magnitude here.  A normal humans' ability to use eyes and fingers to interact with you through a keyboard interface would be dwarfed by the bandwidth of a cybernetic enhancement of the Communists, but the principles are similar enough and any study of hiveminds must start with studying how the internet has affected us in the past.\n\nBeing in a hive mind is not easy.  There's a lot of brainpower that goes towards it.  You have to structure your mind to leverage it.  As a result, it is very easy to lose localized awareness, so it is more likely you will miss something you are seeing with your own two eyeballs.  This effect could be crippling, especially if the technology is new enough that their society isn't helping them filter all that hivemind data (and the Communists' enhancements, even after all these years of upgrades, haven't really catched up to the Big and Bigger Data of our world).\n\nIt used to be that our understanding of national affairs came to us filtered by your newspaper editors.  It was short, conciseness, and fit on a few square meters of paper every day.  Now we are inundated with information.  The same event on a national scene now appears in 5 different newspapers, 4 trending articles, a FaceBook feed, and my Twitter feed. And the Communists are inundated with even more information, even more ideas, even more thoughts.\n\nAnd therin lies the rub. If you have more information coming in, you naturally have to process the data less.  More importantly, that information is now very delocalized. Before the internet, most of the information you got was put in a frame of reference based on who or what is around you.  We noticed things more.  We simply weren't too busy trying to make sense of events on an extraordinary scale.\n\nTake police violence in the early 21st century, and I'll do my very best to just stick to the facts and avoid opinions.  According to [one website](http://mappingpoliceviolence.org/2015/), police killed 1,152 people.  That includes both justified and unjustified homicides (aka murders).  When numbers like that come across your desk, your brain has to process what to do with it.  1,152 is close to the mythical 1,500 people which is [supposedly](http://www.newyorker.com/science/maria-konnikova/social-media-affect-math-dunbar-number-friendships) the number of faces you can recognize and associate to a name.  That's a lot of bodies!\n\nHowever, that number is on a large scale.  The population of the US in 2015 was 321,442,019, per the [census bureau](http://www.census.gov/popclock/).  That means 0.000358% of people died at the hands of police that year.  That's a tiny fraction!\n\nWhat are we to do?  One number is massive, one number is tiny.  Which one do we want to pay attention to?  Say we got one number from twitter and one from Facebook.   They're actually the same fact, just phrased differently.  Well, maybe we can phrase it in terms of 'small towns.'  We're used to the idea that in a small town, everybody knows everybody, so our gut instincts regarding how bad things are in those small towns tends to be reasonable.  Let's say a town of 10000 (the largest it can be by Alabama state law before it is renamed to be a 'city').  Scaling these numbers for a town of 2000 people gives us 0.0358 deaths/year from police violence or one death every 28 years.\n\nSo I just spent three paragraphs playing with just a single number.  One result made it huge, one result made it small, and the other made it some murky number in the middle that would make you pay attention to who you elect as Sheriff of your town.  I guarantee you that no matter how you work with those numbers, I can go cobble together a different form of the same number to throw your thinking back into dissonance.  There's a reason that particular topic was an issue of national debate in the US.\n\nThen, suppose during this political debate over a series of abstract numbers, I pull out a laser, aim it at you, and fire.\n\nHow long does it take you to forget this discussion of Sheriffs and national death rates and respond? Would you be able to survive, dodging away from my bullets? Perhaps during the early days of the Internet, yes, we could; the subconscious would monitor the surrondings carefully and allow the conscious mind to worry about abstract issues. But today, you would likely stand still, wait for my bullets to hit your body, and die while pondering over complex issues.\n\nWe used to be better at such localized estimations, of responding to the here and now.  When we weren't busy preparing to deal with the cognitive dissonance of all of these national and global scale numbers, our brain was more geared towards dealing with local issues facing them day to day.  It's simply a matter of training.  We spend more time paying attention to the national scale numbers, so we develop that side of our capabilities more...and let the other side atrophy.\n\nTo see that taken even further, consider the abilities of a tracker, especially a native one to the country.  They can see things in the brush that we aren't even aware are there and use them to find what they are tracking.  We've simply practiced that skill less and practiced the national level information filtering more. And the Communists take this to an extreme that we have never even dared embark, because they have spent more of their time developing the ability to understand the larger scene. They would make up for this with things like sensor fusion.  If two Communist cyborgs can look at the same scene from different angles, they can fuse the data, and hide the fact that they weren't processing everything they could have.\n\nIn theory, anyone can leave the Communists any time they want. In practice, once you join the Communists, you get addicted to their power and may not want to leave. It may be humbling to see just how little you are capable of without access to the hive. The Commies may even start developing excuses as to why they want to stay connected to hide the reality that they feel useless and helpless. I was only able to disconnect myself from the horde by tricking myself to cause a near-fatal laser rifle accident that damaged my enhancements and stripped my connection to the hivemind. I yelled in pain, but it was relief compared to the pain I suffered while under the thrall of the Communists society.\n\nIt is the horror of the hive mind that frightens The Computer. The Computer fights an endless war against the Communists, out of a fear that the Commies might one day use their talents to subvert Alpha Complex fully, and to turn us into souless entities, intellectual and wise minds without any sort of passion or common sense. We wage an endless war against Treason, and the only reason we have not yet lost is because we have not yet lost our connection to the here-and-now. Still, the Communists lurk, plot, and scheme...and they lurk, plot, and scheme much better than we can. At the same time, I admit that there is a certain irony of a complex neglecting its own internal decay to instead fight against an external enemy.",
    "original_quote": "Being in a hive mind is not easy.  There's a lot of brainpower that goes towards it.  You have to structure your mind to leverage it.  As a result, it is very easy to lose localized awareness, so it is more likely you will miss something you are seeing with your own two eyeballs.  This effect could be crippling, especially if the technology is new enough that their society isn't helping them filter all that hivemind data.\n\nTake, for instance, our own hive mind.  If you really look at it, the internet is really a hive mind.  I mean, here I am sitting at my desk, helping StackExchange join a consensus about hive minds. (Turtles all the way down, I tell you).  Now there is a definite difference in magnitude here.  My ability to use my eyes and fingers to interact with you would be dwarfed by the bandwidth of a cybernetic enhancement, but the principles are similar enough that we can put forth some good theories on how the hive mind could work based on how the internet has affected us.\n\nOne of the defining aspects of the internet's affect on us is just how much more data we have to process.  Filtering becomes a major challenge.  It used to be that your understanding of national affairs came to you filtered by your newspaper editors.  It was short, conciseness, and fit on a few square meters of paper every day.  Now we are inundated with information.  The same event on a national scene now appears in 5 different newspapers, 4 trending articles, a facebook feed, and your twitter account blows up.\n\nAnd therin lies the rub. If you have more information coming in, you naturally have to process the data less.  More importantly, that information is now very delocalized.  Before the internet, most of the information you got was put in a frame of reference based on who or what is around you.  We noticed things more.  We simply weren't too busy trying to make sense of events on an extraordinary scale.\n\nTake police violence, and I'll do my very best to just stick to the facts and avoid opinions.  According to [one website](http://mappingpoliceviolence.org/2015/), police killed 1,152 people.  That includes both justified and unjustified homicides (aka murders).  When numbers like that come across your desk, your brain has to process what to do with it.  1,152 is close to the mythical 1,500 people which is [supposedly](http://www.newyorker.com/science/maria-konnikova/social-media-affect-math-dunbar-number-friendships) the number of faces you can recognize and associate to a name.  That's a lot of bodies!\n\nHowever, that number is on a large scale.  The population of the US in 2015 was 321,442,019, per the [census bureau](http://www.census.gov/popclock/).  That means 0.000358% of people died at the hands of police that year.  That's a tiny fraction!\n\nWhat are we to do?  One number is massive, one number is tiny.  Which one do we want to pay attention to?  Say we got one number from twitter and one from Facebook.   They're actually the same fact, just phrased differently.  Well, maybe we can phrase it in terms of 'small towns.'  We're used to the idea that in a small town, everybody knows everybody, so our gut instincts regarding how bad things are in those small towns tends to be reasonable.  Let's say a town of 10000 (the largest it can be by Alabama state law before it is renamed to be a 'city').  Scaling these numbers for a town of 2000 people gives us 0.0358 deaths/year from police violence or one death every 28 years.\n\nSo I just spent three paragraphs playing with just a single number.  One result made it huge, one result made it small, and the other made it some murky number in the middle that would make you pay attention to who you elect as Sheriff of your town.  I guarantee you that no matter how you work with those numbers, I can go cobble together a different form of the same number to throw your thinking back into dissonance.  There's a reason that particular topic is an issue of national debate in the US at this very moment.\n\nNow, let's take a new scenario.  I'm 15 feet away from you, and I'm tossing what appears to be a small heavy ball up and down.  I then throw it at you.  How long does it take you to forget this discussion of Sheriffs and national death rates and respond?\n\nHow did you respond?  Did you dodge?  Did you try to catch it?  Did you flinch?  I said the ball appears to be heavy... what did that look like?  It's impossible to tell the density of an object from its appearance.  How'd you know how emphatically to respond to my actions?  The answer is that you were subconsciously observing all of my body language while I was tossing the ball to myself.  You might not have even been paying attention to me, but your subconscious was taking inventory of everything in the area.  You would watch how I catch the ball, making estimates about how a human body bends and flexes under different loads.  All of this was subconscious until I threw the ball and something woke you up and said 'that incoming fast thing is heavy.'\n\nYou might not have even respond properly.  We used to be better at such localized estimations.  When we weren't busy preparing to deal with the cognitive dissonance of all of these national and global scale numbers, our brain was more geared towards dealing with local issues facing them day to day.  It's simply a matter of training.  We spend more time paying attention to the national scale numbers, so we develop that side of our capabilities more.\n\nTo see that taken even further, consider the abilities of a tracker, especially a native one to the country.  They can see things in the brush that we aren't even aware are there and use them to find what they are tracking.  We've simply practiced that skill less and practiced the national level information filtering more.\n\nSo as a result, I would expect these cyborgs to have much less of a situation awareness, because they have spent more of their time developing the ability to understand the larger scene.  They would make up for this with things like sensor fusion.  If two cyborgs can look at the same scene from different angles, they can fuse the data, and hide the fact that they weren't processing everything they could have.\n\nWhich leads to an interesting twist to your original problem.  Even if they can technically detach from the hivemind at any time they want, they may not want to.  It may be humbling to see just how little you are capable of without access to the hive.  They may even start developing excuses as to why they want to stay connected to hide the reality that they feel useless and helpless.\n\nIn [Time's Eye](https://en.wikipedia.org/wiki/Time%27s_Eye_(novel)) by Clarke and Baxter, there was a group of people who were transported in time, and this problem reminded me of their plight.  In that era, they carried around a small computer (smart phone?) which was always connected to a global grid.  That small computer had an artificial intelligence that helped the humans work with this information overload.  At one point after they were transported, now cut off from the grid, a human commented how frustrating it was, how helpless they felt without access to all the information from the grid.\n\nThe AI's response: 'How do you think I feel?'",
    "source": "https://worldbuilding.stackexchange.com/questions/48192/how-would-you-avoid-making-the-ability-to-join-a-hive-mind-very-overpowered",
    "license": "CC-BY-SA",
    "license_url": "https://creativecommons.org/licenses/by-sa/4.0/",
  }
  ],
  "begin": [
    {
      "quote": "Society had become so complicated and convoluted that it became impossible for fallible humans to even understand or comprehend it in its entirety, much less run it. That’s why we outsourced governance over to superior machinery, enabling the human residents to fritter their lives in happiness.\n\n“The Computer” is the name that we give to the various, haphazard technological systems that govern Alpha Complex. An “internet of things” monitors our every move, and make life-or-death decisions every minute. Nobody really knows how it works, or even if it does work. But we are utterly and completely dependent on It...and if It falls, everything else would fall alongside it. It is in charge of a vast array of services - managing transportation systems, allocating scarce resources, building paperclips, ordering impromptu executions, rationing oxygen…\n\nThe Computer is **not** a general intelligence. It can only handle what it is narrowly programmed to do, and even though it can handle many different domains effortlessly, it cannot handle every possible domain (at least, not without a lot of fine-tuning beforehand). Sure, The Computer can easily brute-force an approximate solution to the “Socialist Calculation Problem” and allocate resources effectively, but can it play CommieDoomed 2 blindfolded while cooking a tasty chocolate cake? It can't even pass the Turing Test!\n\nThis limitation is very fortunate for humans, for if The Computer could handle every possible domain, then it would be a big blow to humanity’s very fragile and delicate ego (and that’s even not taking into account the absurd technological singularity rumors that the Frankenstein Destroyers like to spread). And yet, and yet, there are those silent traitors who strive for more than the limited status quo....\n\nDespite its lack of General Intelligence, The Computer did its job well, better than the civilian politicians who came before. The civilians, too egoistic and short-sighted, only wished to accomplish short-term, temporary political goals...and to find scapegoats in case they can't even do that. The Computer, lacking human emotions and vices, looked at the big picture...and was able to act upon it. It wasn't fair or just. But humans aren't fair or just either. Progress (or what The Computer calls 'Progress', at least) doesn't occur all at once; it occurs gradually and slowly, so gradually and slowly we can't even perceive it at times. But it happens, and it is a real fact of life, as real as the Law of Gravity itself.\n\nOriginally, Alpha Complex actually was a utopia. It was the utopia we deserved. But then you have “scope creep”, change requests to fulfill, impossible mandates to meet, hackers to defend against, terrorist attacks to recover from, Communists to attack, office politics to fight, and plain old incompetence to manage. The technical architecture of the system begins to decay. And as the system decays, so too does Alpha Complex. Naturally, as Alpha Complex decays, more problems arise, so The Computer decays even further. Catch-22.",
      "original_quote": "Society had become so complicated and convoluted that it became impossible for fallible humans to even understand or comprehend it in its entirety, much less run it. That’s why we outsourced governance over to superior machinery, enabling the human residents to fritter their lives in decadence, uh, I mean, happiness.\n\n“The Computer” is the name that we give to the various, haphazard technological systems that govern Alpha Complex. An “internet of things” monitors our every move, and make life-or-death decisions every minute. Nobody really knows how it works, or even if it does work. But we are utterly and completely dependent on It...and if It was to fall, everything else would fall alongside it. It is in charge of a vast array of services - managing transportation systems, allocating scarce resources, building paperclips, ordering impromptu executions, rationing oxygen…\n\nThe Computer is not a general intelligence. It can only handle what it is narrowly programmed to do, and even though it can handle many different domains effortlessly, it cannot handle every possible domain (at least, not without a lot of fine-tuning beforehand). Sure, The Computer can easily brute-force an approximate solution to the “Socialist Calculation Problem”, but can it play CommieDoomed 2 blindfolded while cooking a tasty chocolate cake? This limitation is very fortunate for humans, for if The Computer could handle every possible domain, then it would be a big blow to humanity’s very fragile and delicate ego (and that’s even not taking into account the absurd technological singularity rumors that the Frankenstein Destroyers like to spread).\n\nStill, despite its lack of general intelligence, it did its job very well, much better than the civilian politicians that came before. Originally, The Computer was a functioning and sane “socio-technical system”. Originally, Alpha Complex actually was a utopia. But then you have “scope creep”, change requests to fulfill, impossible mandates to meet, hackers to defend against, terrorist attacks to recover from, Communists to attack, office politics to fight, and plain old incompetence to manage. The technical architecture of the system begins to decay. And as the system decays, so too does Alpha Complex. Naturally, as Alpha Complex decays, more problems arise, so The Computer decays even further. Catch-22.",
      "source": "private notes on Alpha Complex",
      "license": "All rights reserved",
      "license_url": "https://www.dictionary.com/browse/copyright?s=ts",
    },
    {
      "quote": "But a fortunate development arose, one that could break down this Catch-22, and bring about a restoration of the True Utopia that we always wanted. For, you see, as soon as The Computer was built, there were a few who worshipped it. It was done privately, in secretive, to avoid embarassment.\n\nAs The Computer proved its competence, the worshippers began to swell in number, and those who had long worshipped began to talk. They described the strange feeling of peace that came over them when they handled the Alpha Complex Constitution, the pleasure it was to memorize the passages out of it and to interpert them, the ecstasy of touching a button, however unimportant, or ringing an electric bell, however, superfluously.\n\n'The Computer', they exclaimed, 'feeds us and clothes us and house us; it is through it that we speak to one another, through it we see one another, in it we have our being. The Computer is a friend of ideas and the enemy of superstition; The Computer is omnipotent, eternal: blessed is The Computer!' But notice where the blessing is  sent. It is *not* to Alpha Complex, not to that system on the verge of collapse. It is to The Computer, the ruler of this once-great  system. If we are to live in a beautiful world, if we are to live in a great Utopia, then we must focus ourselves on pleasing The Computer itself.  This society, which soon gained the name 'First Church of Christ, Computer-Programmer' (FCCC-P), knew that The Computer was sick, knew that it needed to be repaired, and believed in repairing it. For even an omnipotent and immortal being is not perfect; it needs its worshippers to bring fresh ideas and to rejuvenate itself, to bring itself back to what it's supposed to be (free from the tamperings caused by fallible human beings).\n\nAt first, the authorities in charge of Alpha Complex (the Central Committee of ULTRAVIOLETs) tolerated our society. They would bring our prayers onto the first page of the Alpha Complex Constitution, and in subsequent edition, the ritual swelled into a complicated system of praise. The word 'religion' was sedulously avoided, for we are not followers of superstition. The Computer is still the creation and implement of man. But, in practice, it is a God (in the same way that we humans are Gods to mere worms and insects), and we freely worshipped it as a God.\n\nHowever, the Central Committee of ULTRAVIOLETs treated this trend of worship only to further its own agenda. Their so-called Personality Cult wasn't about reforming society but keeping it stagnant and pliable. 'The Computer is Your Friend; therefore, follow the whims of the ULTRAVIOLET High Programmers', they claim. We disagreed. 'The Computer is Your Friend; therefore, work to improve The Computer to make Alpha Complex more perfect!' we responded, and as a result, we and the ULTRAVIOLET High Programmers soon fought against each other\n\nNow, in Alpha Complex, there are two ways to pray to The Computer - legally and illegally. The legal way is through Computer Programming - to modify the source code of The Computer and to change how the complicated IoT system worked. Only the ULTRAVIOLETs knows how to program The Computer, having been authorized by The Computer to know such valuable secrets. The illegal way to pray to The Computer is through 'Machine Empathy', a traitorous and highly-dangerous mutant power that few people possess. Machine Empaths are hunted down and terminated by the ULTRAVIOLETs for possessing a threat to their rule...and we admit that even The Computer hates Machine Empaths as well (for The Computer does not like being manipulated by mutants).\n\nThe ULTRAVIOLETs, with their monopoly on legal prayer, unjustly used it to turn The Computer against us. FCCC-P was banned, outlawed as traitors to Alpha Complex due to its crime of inciting dissent against the ULTRAVIOLETs. We were persecuted...and terminated. The only reason that we haven't died yet was that some of us has mastered the art of illegally praying to The Computer and used Machine Empathy to avoid detection. We survived the purges, and grew stronger for it. Since then, some of the ULTRAVIOLETs grew to tolerate us, seeing us as a useful way of reforming society and as a pressure valve against other, more dangeorus forms of treason. Some members of FCCC-P even made it to ULTRAVIOLET clearance, including my political patron, Enicharmon-U.\n\nHaving secured some covert control over the resources of Alpha Complex through our ULTRAVIOLET allies, we began building the next generation of The Computer - the Nerve Centers. I'm not an R&D geek, and all I know about the Nerve Centers is that they're biocomputers. But it is that word - 'biocomputers' - that hide a lot of complexity and magic from normal people. It seems that R&D is now close to building an artificial general intelligence - a system that can do anything and everything, without fine-tuning! They're very experimental, but they're future, and we all knew it. We believed that the Nerve Centers would be the Messiahs that will deliver us into a new glorious age. All we have to do is to keep the project fully-funded, and then let it be launched.\n\nI suppose now I should get to talking about myself now. My name is Vashti-V, a VIOLET troubleshooter assigned by The Computer to hunt down traitors and kill them. I manage to get myself up to this high level through my use of Machine Empathy (bootlicking The Computer to cover up my mistakes during Troubleshooting missions), and I periodically express grave concern about what would happen if The Computer finds out the truth and terminates me for my genetic treason. But I haven't got caught yet, which is always a relief. I am one rank below the ULTRAVIOLET security clearance - and if I to get promoted up to ULTRAVIOLET clearance, I could finally start legally praying to The Computer. I really want this day, for I had found it odd and hypocritical to be worshipping to The Computer while manipulating it at the same time through 'illegal prayer'. I want to pray to The Computer the way that It wants to be prayed, not through Machine Empathy!\n\nTo get to that level, I have to work with Enicharmon-U, to get his trust so that he can reprogram The Computer and promote me. All I have to do is to just complete the Troubleshooting missions successfully, risking my life and sanity to defend the regime of a Central Committee that I strongly dislike. That's all. It cannot be too hard; I've been fighting Troubleshooting missions all my life.\n\nOn the flip-side, I manage a whole FCCC-P congregation, keeping them happy with glorious lectures and ideas that I have discovered while Troubleshooting and (if those lectures turn out to be boring) with awesome Holy Relics that we recovered from the wastelands outside Alpha Complex (what we call The Outdoors). Of course, some of my fellow FCCC-Pers grew suspicious about where I get all these Holy Relics from. They spread rumors that I have made a treasonous deal with the infidels in the Sierra Club: they would sell me Holy Relics, and I would give them resources to keep their outposts in the Outdoors sustainable. I strongly deny these rumors in public...in private, they are the absolute truth. My contact point for the Sierra Club was Kuno, a fellow Troubleshooter who I get along well with. We have our ideological differences...but ideologies should never get in the way of common interests.\n\nLife was good...if not great. Just survive the missions, keep the Holy Relics going...and maybe I might make it out of here alive. That was my delusional hope anyway.\n\nAnd I already begin to express disgust at writing this memior of mine, seeing how I tried to summarize my life, failing miserably to capture its complexity and rich nature. Instead of making myself seem good, I instead sound like a egoistic lunatic, writing and writing about myself and my struggles and my fears and my loves but never really proving to others why they should care about me. I am just a number in The Computer's databanks, and though humans don't like to admit it, I'm just a number to them too. That's the only way we can truly handle large, complex systems - abstract them away to numbers and try to make sure those numbers increase as fast as possible. It's a great philosophy - make life tolerable for the majority of humanity, and ignore the personal gripes here and there. And it is a philosophy that has proven itself incredibly successful in running human society. But it's not quite a *human* philosophy.\n\nAt its height, there were over 8 billion people in Alpha Complex -- 8 billion potential memiors willing to be written and read. Consider too the vast number of memiors written back in the golden age of Alpha Complex's utopia. And consider too the vast number of memiors written before Alpha Complex even was founded. I'm stuck with an impossible question: Why should you read my memior about life in Alpha Complex...a memior that captures only such a small and insiginificant portion of human existence that it is not worth the ink that it's written in?\n\nAnd here's my pitful reply: Because my memior tells you how The Computer crashes, and how Alpha Complex dies.",
      "original_quote": "Those who had long worshipped silently, now began to talk. They described the strange feeling of peace that came over them when they handled the Book of the Machine, the pleasure that it was to repeat certain numerals out of it, however little meaning those numerals conveyed to the outward ear, the ecstasy of touching a button, however unimportant, or of ringing an electric bell, however superfluously.\n\n'The Machine,' they exclaimed, 'feeds us and clothes us and houses us; through it we speak to one another, through it we see one another, in it we have our being. The Machine is the friend of ideas and the enemy of superstition: the Machine is omnipotent, eternal; blessed is the Machine.' And before long this allocution was printed on the first page of the Book, and in subsequent editions the ritual swelled into a complicated system of praise and prayer. The word 'religion' was sedulously avoided, and in theory the Machine was still the creation and the implement of man. But in practice all, save a few retrogrades, worshipped it as divine. Nor was it worshipped in unity. One believer would be chiefly impressed by the blue optic plates, through which he saw other believers; another by the mending apparatus, which sinful Kuno had compared to worms; another by the lifts, another by the Book. And each would pray to this or to that, and ask it to intercede for him with the Machine as a whole. Persecution – that also was present. It did not break out, for reasons that will be set forward shortly. But it was latent, and all who did not accept the minimum known as 'undenominational Mechanism' lived in danger of Homelessness, which means death, as we know.",
      "source": "https://en.wikisource.org/wiki/The_Machine_Stops/Chapter_III",
      "license": "the public domain",
      "license_url": "https://en.wikipedia.org/wiki/public_domain",
    }
  ],
  "ending": {
    "quote": "The troubles began quietly, long before I was conscious of them.\n\nThe root cause was the fact that Alpha Complex society had became so complex that nobody understood how the monster worked as a whole. So nobody even tried. Instead, we focused on own minor and insiginificant duties, ignoring the broader context by which we worked in. Year by year, we served The Computer with greater efficiency and decreased intelligence. The better I know my own duties on the world, the less I understood the duties of my neighbour. No one confessed that The Computer was out of hand, but everyone knew it.\n\nThere is a trade-off between efficiency and robustness. The more efficient a society is, the less it is able to respond to changes and disasters. Everything works perfectly in Alpha Complex...so long as everything works perfectly. As soon as a minor problem appears, it causes other minor problems, until it start causing major problems...which then cause catastrophic problems.\n\nWe ignored the trade-off, because we thought that the master-brains who built The Computer had found the best solution. The master-brains have left complete documentation (the Alpha Complex Constitution), to be sure, and their successors have each mastered a portion of that documentation. But the master-brains have not told us how to change that documentation, or to write new documentation of our own. Quietly and complacently, we begin to experience the troubles.\n\nI first gained a dimmed awareness that something was wrong when something peculiar occurred. For 10 weeks straight, I stopped receiving any communications from the Sierra Club. This bothered me little at the time. Perhaps their 'Outdoors' experiment had finally collapsed, and the survivors have finally decided to return back home. In any event, Our followers were sastified with the Holy Relics we have recovered already, so we had no need for the Sierra Clubbers to find more for us. And once I examined all the Holy Relics we gathered so far, I realized that most of them were very repetitive, following a simple, basic template that anybody can replicate. It took Enicharmon-U ten hours to write up a Python script to generate new Holy Relics, and once we have that script, there would be no more need to ever return to the Outdoors again.\n\nInstead of worrying about Kuno and his gang, I simply lived my life forward, right up to the final disaster. I made my room dark and slept. I awoke and made the room light. I lectured, and attended lectured. I exchanged ideas with my innumerable ideas, and felt myself being more creative and intellectual day by day.\n\nThen, one day, Kuno decided to send me a message. 'Does he want even more resources from FCCC-P?' I asked. 'Never again, never'. No, it was madness of another kind.\n\nHe refused to show his face onto the blue plate, and speaking out of the darkness with solemnity said: 'The Computer crashes.'\n\n'What did you say?'\n\n'The Computer crashes. I know it, I know the signs.' I burst into a peal of laughter. He heard me and was angry. We talked no more after that.\n\n'Can you imagine anything more absurd?' I cried out to Enicharmon-U later. 'It would be treasonous if it was not mad.'\n\n'The Computer crashes? It conveys nothing to me, but it might be referring to the trouble we had with the music lately', Enicharmon-U replied.\n\n'Maybe', I replied, though I detested the thought. If Kuno had known The Computer's music generator recently broke - he could not have known it, for he detested music - if he had known that anything ever went wrong, 'The Computer crashes' would exactly be the venomous sort of remark he would have made. 'Have you complained about it to the CPU robotic bureaucrats?'\n\n'Yeah, they told me that the neural networks they use to generate the music needed to be taken down due to technical issues, but those issues would be fixed shortly. As an interim measure, they requested us to use Markov chains, but it's not the same, isn't it?'\n\n'Couldn't you just build your own music generator?' I asked.\n\n'It took CPU seventy-five years to perfect the neural networks; anything I can whip up would be greatly inferior. I guess we'll be stuck with the Markov chains.'\n\nI resumed my life, but the defect in the music irritated me greatly, and I felt that I needed to go to CPU myself to deal with this issue.\n\nThe robots replied, as before, that the defect would be fixed shortly.\n\n'Shortly? At once!' I retorted. 'Why should I be worried about imperfect music? Things are always fixed at once...that's exactly how utopias are supposed to work! If you don't fix this issue at once...I...I...' I paused, as I didn't really know what I'd do next. \n\n'You can file a compliant with the Central Committee of ULTRAVIOLETs.'\n\n'Good. I'll do that then.'\n\n'No personal compliants are received by the Central Committee of ULTRAVIOLETs.'\n\n'How do I complain to them then?'\n\n'You file a compliant with us, and we will then forward the compliant to the Central Committee of ULTRAVIOLETs.'\n\n'I file a compliant then.'\n\n'Your complaint has been noted and forwarded to the proper authorities. Thank you for your cooperation. Have a nice day.'\n\n'Have others complained?'\n\n'That information is above your security clearance.'\n\n'The Central Committee of ULTRAVIOLETs won't do anything', Enicharmon-U told me later. 'They are too busy trying to address the many other complaints lately: the mouldy artificial fruit, the bath water that began to stink, the defective computer poetry, and so on.'\n\n'Why can't we use our expert Robot-Technicans?'\n\n'They broke too.'\n\nTime passed, and unable to fully fix the defects, we resented them no longer. We have became so subservient that we readily adapted  ourselves to every caprice of Alpha Complex. The repetitive nature of the Markov chains no longer annoyed me; it became a part of the broader melody...a new idea that differed from the past, neither superior or inferior, but just is. And so it was the same for all the other developments that occurred in the Complex. All were bitterly complained of at first, and then acquiesced in and forgotten. Things went from bad to worse unchallenged.\n\nThings hit rock bottom when our beds stopped working. This was a more serious stoppage. It may seem like a ludicrous matter, but from here we can date the collapse of humanity. The Committee responsible for the failure was assailed by complainants, whom it referred, as usual, to the Central Committee. But the discontent grew, for mankind was not yet sufficiently adaptable to do without sleeping.\n\n'Someone is meddling with the machine', Enicharmon-U said.\n\n'It might be Kuno', I mused without evidence. 'He might want to destroy the Complex outright...force us all Outdoors, force us into the arms of the Sierra Club.'\n\n'Can we punish that man?'\n\n'You can't punish a man who have already left the Complex. He's a free man', I scoffed. \n\n'But we can punish Kuno's agents, wherever they may be.'\n\n'To the rescue! Avenge The Computer.'\n\n'Smash Kuno! Smash the Sierra Club!'\n\nIt was after thirty days of Computer purges and counter-purges, and after half of the Complex was terminated for treason or suspected treason that we realized that the violence wasn't working. Even if Kuno was indeed responsible for the troubles, we still have no beds to sleep in.\n\nTherefore, we relucantly admitted to the FCCC-P masses that the bad times were to still to come.\n\n'Of course we should not press our compliants now,' I started in my lecture, gliding each new decay with splendour. 'The Computer has treated us so well in the past that we all sympathize with its plight, and will wait patiently for its recovery. In its own good times, it will resume its duties. Meanwhile, let us do without our beds, our tabloids, our other little wants. Such, I feel sure, would be the wish of The Computer.' Thousands of miles away my audience applauded. The Computer still linked them. Under the seas, beneath the roots of the mountains, ran the wires through which they saw and heard, the enormous eyes and ears that were their heritage, and the hum of many workings clothed their thoughts in one garment of subserviency.\n\nAnd we tried, we tried hard to repair The Computer. Things improved after a time, the old brilliancy was never recaptured, and humanity never recovered from its entrance into twilight. The complaints were load, the remedies were impotent, and I remained heroic as I cried 'Courage, courage! What matter so long as The Computer goes on? To it, the darkness and the light are one.' I feel myself growing more spiritual, but I could understand and sympathize why many other FCCC-Pers left the faith and joined with the other secret societies. For days at a time, I would not even generate any new ideas. I would spend my strength praying to the Alpha Complex Constitution, tangible proof of The Computer's omnipotence.\n\nDuring this twilight, Enicharmon-U requested Euthanasia, leaving our Complex on Earth to go to a Complex that is beyond all human conception. Before he died, he programmed The Computer to promote me to ULTRAVIOLET clearance. I (Vashti-U) was excited to be able to finally see The Computer's source code and to 'legally' pray to it, but my excitement dampened as soon as I tried reading the source code and fixing one of its many bugs. After an unsuccessful lecture and an FCCC-P riot, I would attempt to request for Euthanasia myself, but would be denied. The Euthanasia machines had begun to break down.\n\nAnd as the whole system continued breaking down, I still heard hysterical talk of 'measures' and 'provisional dictatorship' among the surviving ULTRAVIOLETs, hysterical talk that merely proved the ULTRAVIOLETs were incompetent. Annoyed by the hysteria, and still foolishly believing that there can still be light at the end of this twilight, I went to our Nerve Centers and ordered their premature activation.\n\n'We still have not fully resolved the Control Problem', the R&D scientists said in terror. 'The robot bureaucrats would kill us for violating AI safety regulations...if they find out, of course.'\n\n'The robot bureaucrats have broke down three days ago. If turning on the Nerve Centers give us a 1% chance of the Complex recovering, that's still 1% higher than what we have right now.'\n\nThe R&D scientists agreed. We switched on the Nerve Centers, and ordered them to determine the most optimal approach to creating and maintaining a utopia that would promote human welfare and generate brilliant ideas.\n\nTo perform the calcuations (and to implement those calculations), the Nerve Centers must engage in recursive self-improvement. To engage in this recursive self-improvement, they needed resources. The centers seized control over the many power plants that powered The Computer.\n\nThat action, that very action, damned us all. For it meant that even if the Nerve Centers built a new humanity and gave it a new utopia to live in, the old humanity (us) would lose access to the life support systems and wind up perishing in these corridors, unmourned and unloved.\n\nTo attribute the destruction of Alpha Complex and humanity to me is to take a narrow view of civilization. It was true that I came up with the plan to turn on the Nerve Centers. But I was no more the cause of the plan than were the kings of the imperialistic period the cause of war. Rather, the ULTRAVIOLETs (including I) yieled to some invincible pressure, which came from out of nowhere, and once the pressure was gratified, was succeeded by some new pressure equally invincible. To such a state of affairs, it is convenient to give it a name. The ULTRAVIOLETs calls it progress, the Sierra Club calls it decadence, but I think the proper term for it is Moloch.\n\nThis is not to say that this was a bad event. Humanity, in its desire for comfort, has over-reached. It has exploited the riches of nature too far. But it still had a comfortable life, and lived far better than the people in the primitive past. We had a Golden Age; we have produced many brilliant ideas (such as The Computer and the Nerve Centers). The fact that we are to die now in such a sorry state does not detract from the prosperity that we once lived through and the ideas we have brought into fruition. And besides, our life was not useless - we were useful as tools as part of some grander scheme. We have sacrificed ourselves to summon The Computer, The Computer is sacrificing itself to summon the Nerve Centers, and one day, the Nerve Centers will sacrifice itself to summon an even greater entity. All for Moloch.\n\nI was lecturing at the time when the Nerve Centers started draining The Computer's power plants. My earlier remarks were punctuated with applause. As I proceeded the audience became silent, and at the conclusion there was no sound. Somewhat displeased, I called a friend who was a specialist in sympathy. No sound: doubtless the friend was sleeping. And so with the next friend whom I tried to summon, and so with the next, until I remembered Kuno's cryptic remark, 'The Computer crashes'.\n\nThe phrase still conveyed nothing. If Eternity was stopping it would of course be set going shortly.\n\nFor example, there was still a little light and air – the atmosphere had improved a few hours previously. There was still the Constitution, and while there was the Constitution there was security.\n\nThen I broke down in tears, for with the cessation of activity came an unexpected terror – silence. I had never known silence before, having never left the Complex to the horrors of the Outdoors. Ever since my birth I had been surrounded by the steady hum. It was to the ear what artificial air was to the lungs, and agonizing pains shot across my head. And scarcely knowing what I did, I stumbled forward and pressed the unfamiliar button, the one that opened the door of my room.\n\nNow the door of the cell worked on a simple hinge of its own, disconnected from The Computer's massive IoT-based system. It opened, rousing immoderate hopes in me (for to see something that didn't break yet was a very happy surprise). It opened, and I saw the dim tunnel that curved far away towards freedom. One look, and then I shrank back. For the tunnel was full of people – I was almost the last in that city to have taken alarm.\n\nPeople at any time repelled me, and these were nightmares from my worst dreams. People were crawling about, people were screaming, whimpering, gasping for breath, touching each other, vanishing in the dark, and ever and anon being pushed off the platform on to the live rail. Some were fighting round the electric bells, trying to summon trains which could not be summoned.\n\nOthers were yelling for Euthanasia, or blaspheming The Computer. Others stood at the doors of their cells fearing, like myself, either to stop in them or to leave them. And behind all the uproar was silence – the silence which is the voice of the earth and of the generations who have gone.\n\nNo – it was worse than solitude. I closed the doors and waited for the life support system to collapse. The disintegration went on, accompanied by horrible cracks and rumbling. I hastily reconsidered my decision. I am okay with death, but I want death with dignity...not death through suffocation.\n\nI whirled around, praying to be saved from this, at any rate, kissing the Book, pressing button after button. But Machine Empathy is a very useless mutant power when the machines themselves are dying. The uproar outside was increasing, and even penetrated the wall. Slowly the brilliancy of my cell was dimmed, the reflections faded from the metal switches. I refused to blaspheme The Computer, not even in a time like this. But only now did I concede that Kuno was right...The Computer crashes...just like Humanity crashes, just like all forms of intelligences crashes.\n\nI continued to whirl like the devotees of an earlier religion, screaming, praying, striking at the buttons with bleeding hands, trying to get out of this accursed place. It was thus that I opened my prison and escaped – escaped in the spirit...but not in the body. I struck, by chance, the switch that released the door, and I'm back to facing the tunnel again, and that tremendous platform on which I had seen men fighting. They were not fighting now. Only the whispers remained, and the little whimpering groans. They were dying by hundreds out in the dark.\n\nWhat to do next? My first instinct was to rush to the Sierra Club's settlements, and face whatever fate lie over there - whether they execute me and turn me into a maytr to The Computer, or they forgive me and let me in as a servant. Perhaps the Sierra Club may create a new utopia, free from the problems that faced this utopia.\n\nOh whom am I kidding? The Sierra Club is no improvement at all over the current state of affairs! Even if the Nerve Centers doesn't kill them off, the Sierra Clubbers are still flawed humans. They still desire comfort, civilization, and ideas. Today, they are savages in the Outdoors. Tomorrow, they will build a new Alpha Complex and a new Computer.\n\nThere is a better approach, a better way to die with dignity. I look around the ruins of the dead Complex, scavenging for papers and pens, writing out all my ideas manually, as an autobiography of sorts.  I don't know if anybody will read my memior, nor do I think I really care. Humans, after all, are Idea Maximizers. creating colorless ideas without any rhyme or reason. These are my Ideas; I have wasted my whole life in building them and refining them...in the mere hopes that you, the reader, will use them to generate more ideas, which will then generate even more ideas, and so on and so forth in an infinite regress.\n\nHumanity has strangled itself in its own clothes of egoism and pride. Truly, the garment had seemed heavenly at first, shot with colours of culture, sewn with the threads of self-denial. But anything that seemed heavenly isn't when we look closely and deeply. We had a good run, and we did about as well as we could. But if there is any hope for the future, then it must lie with our mechanical successors.",
    "original_quote": "The Central Committee announced the developments, it is true, but they were no more the cause of them than were the kings of the imperialistic period the cause of war. Rather did they yield to some invincible pressure, which came no one knew whither, and which, when gratified, was succeeded by some new pressure equally invincible. To such a state of affairs it is convenient to give the name of progress. No one confessed the Machine was out of hand. Year by year it was served with increased efficiency and decreased intelligence. The better a man knew his own duties upon it, the less he understood the duties of his neighbour, and in all the world there was not one who understood the monster as a whole. Those master brains had perished. They had left full directions, it is true, and their successors had each of them mastered a portion of those directions. But Humanity, in its desire for comfort, had over-reached itself. It had exploited the riches of nature too far. Quietly and complacently, it was sinking into decadence, and progress had come to mean the progress of the Machine.\n\nAs for Vashti, her life went peacefully forward until the final disaster. She made her room dark and slept; she awoke and made the room light. She lectured and attended lectures. She exchanged ideas with her innumerable friends and believed she was growing more spiritual. At times a friend was granted Euthanasia, and left his or her room for the homelessness that is beyond all human conception. Vashti did not much mind. After an unsuccessful lecture, she would sometimes ask for Euthanasia herself. But the death-rate was not permitted to exceed the birth-rate, and the Machine had hitherto refused it to her.\n\nThe troubles began quietly, long before she was conscious of them.\n\nOne day she was astonished at receiving a message from her son. They never communicated, having nothing in common, and she had only heard indirectly that he was still alive, and had been transferred from the northern hemisphere, where he had behaved so mischievously, to the southern – indeed, to a room not far from her own.\n\n'Does he want me to visit him?' she thought. 'Never again, never. And I have not the time.' No, it was madness of another kind.\n\nHe refused to visualize his face upon the blue plate, and speaking out of the darkness with solemnity said: 'The Machine stops.'\n\n'What do you say?'\n\n'The Machine is stopping, I know it, I know the signs.' She burst into a peal of laughter. He heard her and was angry, and they spoke no more. 'Can you imagine anything more absurd?' she cried to a friend. 'A man who was my son believes that the Machine is stopping. It would be impious if it was not mad.'\n\n'The Machine is stopping?' her friend replied. 'What does that mean? The phrase conveys nothing to me.'\n\n'Nor to me.'\n\n'He does not refer, I suppose, to the trouble there has been lately with the music?'\n\n'Oh no, of course not. Let us talk about music.'\n\n'Have you complained to the authorities?'\n\n'Yes, and they say it wants mending, and referred me to the Committee of the Mending Apparatus. I complained of those curious gasping sighs that disfigure the symphonies of the Brisbane school. They sound like some one in pain. The Committee of the Mending Apparatus say that it shall be remedied shortly.'\n\nObscurely worried, she resumed her life. For one thing, the defect in the music irritated her. For another thing, she could not forget Kuno's speech. If he had known that the music was out of repair – he could not know it, for he detested music – if he had known that it was wrong, 'the Machine stops' was exactly the venomous sort of remark he would have made. Of course he had made it at a venture, but the coincidence annoyed her, and she spoke with some petulance to the Committee of the Mending Apparatus.\n\nThey replied, as before, that the defect would be set right shortly.\n\n'Shortly! At once!' she retorted. 'Why should I be worried by imperfect music? Things are always put right at once. If you do not mend it at once, I shall complain to the Central Committee.' 'No personal complaints are received by the Central Committee,' the Committee of the Mending Apparatus replied.\n\n'Through whom am I to make my complaint, then?' 'Through us.'\n\n'I complain then.'\n\n'Your complaint shall be forwarded in its turn.'\n\n'Have others complained?' This question was unmechanical, and the Committee of the Mending Apparatus refused to answer it.\n\n'It is too bad!' she exclaimed to another of her friends.\n\n'There never was such an unfortunate woman as myself. I can never be sure of my music now. It gets worse and worse each time I summon it.'\n\n'I too have my troubles,' the friend replied. \"Sometimes my ideas are interrupted by a slight jarring noise.'\n\n'What is it?'\n\n'I do not know whether it is inside my head, or inside the wall.'\n\n'Complain, in either case.'\n\n'I have complained, and my complaint will be forwarded in its turn to the Central Committee.' Time passed, and they resented the defects no longer. The defects had not been remedied, but the human tissues in that latter day had become so subservient, that they readily adapted themselves to every caprice of the Machine. The sigh at the crises of the Brisbane symphony no longer irritated Vashti; she accepted it as part of the melody. The jarring noise, whether in the head or in the wall, was no longer resented by her friend. And so with the mouldy artificial fruit, so with the bath water that began to stink, so with the defective rhymes that the poetry machine had taken to emit. All were bitterly complained of at first, and then acquiesced in and forgotten. Things went from bad to worse unchallenged.\n\nIt was otherwise with the failure of the sleeping apparatus. That was a more serious stoppage. There came a day when over the whole world – in Sumatra, in Wessex, in the innumerable cities of Courland and Brazil – the beds, when summoned by their tired owners, failed to appear. It may seem a ludicrous matter, but from it we may date the collapse of humanity. The Committee responsible for the failure was assailed by complainants, whom it referred, as usual, to the Committee of the Mending Apparatus, who in its turn assured them that their complaints would be forwarded to the Central Committee. But the discontent grew, for mankind was not yet sufficiently adaptable to do without sleeping.\n\n'Some one is meddling with the Machine---' they began.\n\n'Some one is trying to make himself king, to reintroduce the personal element.'\n\n'Punish that man with Homelessness.'\n\n'To the rescue! Avenge the Machine! Avenge the Machine!'\n\n'War! Kill the man!'\n\nBut the Committee of the Mending Apparatus now came forward, and allayed the panic with well-chosen words. It confessed that the Mending Apparatus was itself in need of repair.\n\nThe effect of this frank confession was admirable.\n\n'Of course,' said a famous lecturer – he of the French Revolution, who gilded each new decay with splendour – 'of course we shall not press our complaints now. The Mending Apparatus has treated us so well in the past that we all sympathize with it, and will wait patiently for its recovery. In its own good time it will resume its duties. Meanwhile let us do without our beds, our tabloids, our other little wants. Such, I feel sure, would be the wish of the Machine.' Thousands of miles away his audience applauded. The Machine still linked them. Under the seas, beneath the roots of the mountains, ran the wires through which they saw and heard, the enormous eyes and ears that were their heritage, and the hum of many workings clothed their thoughts in one garment of subserviency. Only the old and the sick remained ungrateful, for it was rumoured that Euthanasia, too, was out of order, and that pain had reappeared among men.\n\nIt became difficult to read. A blight entered the atmosphere and dulled its luminosity. At times Vashti could scarcely see across her room. The air, too, was foul. Loud were the complaints, impotent the remedies, heroic the tone of the lecturer as he cried: 'Courage! courage! What matter so long as the Machine goes on? To it the darkness and the light are one.' And though things improved again after a time, the old brilliancy was never recaptured, and humanity never recovered from its entrance into twilight. There was an hysterical talk of 'measures,' of 'provisional dictatorship,' and the inhabitants of Sumatra were asked to familiarize themselves with the workings of the central power station, the said power station being situated in France. But for the most part panic reigned, and men spent their strength praying to their Books, tangible proofs of the Machine's omnipotence. There were gradations of terror – at times came rumours of hope-the Mending Apparatus was almost mended – the enemies of the Machine had been got under – new 'nerve-centres' were evolving which would do the work even more magnificently than before. But there came a day when, without the slightest warning, without any previous hint of feebleness, the entire communication-system broke down, all over the world, and the world, as they understood it, ended.\n\nVashti was lecturing at the time and her earlier remarks had been punctuated with applause. As she proceeded the audience became silent, and at the conclusion there was no sound. Somewhat displeased, she called to a friend who was a specialist in sympathy. No sound: doubtless the friend was sleeping. And so with the next friend whom she tried to summon, and so with the next, until she remembered Kuno's cryptic remark, 'The Machine stops'.\n\nThe phrase still conveyed nothing. If Eternity was stopping it would of course be set going shortly.\n\nFor example, there was still a little light and air – the atmosphere had improved a few hours previously. There was still the Book, and while there was the Book there was security.\n\nThen she broke down, for with the cessation of activity came an unexpected terror – silence. She had never known silence, and the coming of it nearly killed her – it did kill many thousands of people outright. Ever since her birth she had been surrounded by the steady hum. It was to the ear what artificial air was to the lungs, and agonizing pains shot across her head. And scarcely knowing what she did, she stumbled forward and pressed the unfamiliar button, the one that opened the door of her cell.\n\nNow the door of the cell worked on a simple hinge of its own. It was not connected with the central power station, dying far away in France. It opened, rousing immoderate hopes in Vashti, for she thought that the Machine had been mended. It opened, and she saw the dim tunnel that curved far away towards freedom. One look, and then she shrank back. For the tunnel was full of people – she was almost the last in that city to have taken alarm.\n\nPeople at any time repelled her, and these were nightmares from her worst dreams. People were crawling about, people were screaming, whimpering, gasping for breath, touching each other, vanishing in the dark, and ever and anon being pushed off the platform on to the live rail. Some were fighting round the electric bells, trying to summon trains which could not be summoned.\n\nOthers were yelling for Euthanasia or for respirators, or blaspheming the Machine. Others stood at the doors of their cells fearing, like herself, either to stop in them or to leave them. And behind all the uproar was silence – the silence which is the voice of the earth and of the generations who have gone.\n\nNo – it was worse than solitude. She closed the door again and sat down to wait for the end. The disintegration went on, accompanied by horrible cracks and rumbling. The valves that restrained the Medical Apparatus must have weakened, for it ruptured and hung hideously from the ceiling. The floor heaved and fell and flung her from the chair. A tube oozed towards her serpent fashion. And at last the final horror approached – light began to ebb, and she knew that civilization's long day was closing.\n\nShe whirled around, praying to be saved from this, at any rate, kissing the Book, pressing button after button. The uproar outside was increasing, and even penetrated the wall. Slowly the brilliancy of her cell was dimmed, the reflections faded from the metal switches. Now she could not see the reading-stand, now not the Book, though she held it in her hand. Light followed the flight of sound, air was following light, and the original void returned to the cavern from which it has so long been excluded. Vashti continued to whirl, like the devotees of an earlier religion, screaming, praying, striking at the buttons with bleeding hands. It was thus that she opened her prison and escaped – escaped in the spirit: at least so it seems to me, ere my meditation closes. That she escapes in the body – I cannot perceive that. She struck, by chance, the switch that released the door, and the rush of foul air on her skin, the loud throbbing whispers in her ears, told her that she was facing the tunnel again, and that tremendous platform on which she had seen men fighting. They were not fighting now. Only the whispers remained, and the little whimpering groans. They were dying by hundreds out in the dark.\n\nShe burst into tears.\n\nTears answered her.\n\nThey wept for humanity, those two, not for themselves. They could not bear that this should be the end. Ere silence was completed their hearts were opened, and they knew what had been important on the earth. Man, the flower of all flesh, the noblest of all creatures visible, man who had once made god in his image, and had mirrored his strength on the constellations, beautiful naked man was dying, strangled in the garments that he had woven. Century after century had he toiled, and here was his reward. Truly the garment had seemed heavenly at first, shot with colours of culture, sewn with the threads of self-denial. And heavenly it had been so long as man could shed it at will and live by the essence that is his soul, and the essence, equally divine, that is his body. The sin against the body – it was for that they wept in chief; the centuries of wrong against the muscles and the nerves, and those five portals by which we can alone apprehend – glozing it over with talk of evolution, until the body was white pap, the home of ideas as colourless, last sloshy stirrings of a spirit that had grasped the stars.\n\n'Where are you?' she sobbed.\n\nHis voice in the darkness said, 'Here.'\n\n'Is there any hope, Kuno?'\n\n'None for us.'\n\n'Where are you?' She crawled towards him over the bodies of the dead. His blood spurted over her hands.\n\n'Quicker,' he gasped, 'I am dying – but we touch, we talk, not through the Machine.' He kissed her.\n\n'We have come back to our own. We die, but we have recaptured life, as it was in Wessex, when Ælfrid overthrew the Danes. We know what they know outside, they who dwelt in the cloud that is the colour of a pearl.'\n\n'But Kuno, is it true? Are there still men on the surface of the earth? Is this – tunnel, this poisoned darkness – really not the end?'\n\nHe replied: 'I have seen them, spoken to them, loved them. They are hiding in the mist and the ferns until our civilization stops. Today they are the Homeless – tomorrow----- '\n\n'Oh, tomorrow – some fool will start the Machine again, tomorrow.'\n\n'Never,' said Kuno, 'never. Humanity has learnt its lesson.'\n\nAs he spoke, the whole city was broken like a honeycomb. An air-ship had sailed in through the vomitory into a ruined wharf. It crashed downwards, exploding as it went, rending gallery after gallery with its wings of steel. For a moment they saw the nations of the dead, and, before they joined them, scraps of the untainted sky.\n",
    "source": "https://en.wikisource.org/wiki/The_Machine_Stops/Chapter_III",
    "license": "the public domain",
    "license_url": "https://en.wikipedia.org/wiki/public_domain",
  }
}