{
     "ending": {
        "quote": "The troubles began quietly, long before I was conscious of them.\n\nFor 10 weeks straight, I stopped receiving any communications from the Sierra Club. This bothered me little. Perhaps their 'Outdoors' experiment had finally collapsed, and the survivors have finally decided to return back home. Our followers  were already sastified with the Holy Relics we have recovered already. And once I examined all the Holy Relics we gathered so far, I realized that most of them were very repetitive, following a simple, basic template that anybody can replicate. It took Enicharmon-U ten hours to write up a Python script to generate new Holy Relics, and once we have that script, there would be no more need to ever see the Outdoors again.\n\nInstead of worrying about Kuno and his gang, I simply lived my life forward, right up to the final disaster. I made my room dark and slept. I awoke and made the room light. I lectured, and attended lectured. I exchanged ideas with my innumerable ideas, and felt myself being more creative and intellectual day by day.\n\nThen, one day, Kuno decided to send me a message. 'Does he want even more resources from FCCC-P?' I asked. 'Never again, never'. No, it was madness of another kind.\n\nHe refused to show his face onto the blue plate, and speaking out of the darkness with solemnity said: 'The Computer crashes.'\n\n'What did you say?'\n\n'The Computer crashes. I know it, I know the signs.' I burst into a peal of laughter. He heard me and was angry. We talked no more after that.\n\n'Can you imagine anything more absurd?' I cried out to Enicharmon-U later. 'It would be treasonous if it was not mad.'\n\n'The Computer crashes? It conveys nothing to me, but it might be referring to the trouble we had with the music lately', Enicharmon-U replied.\n\n'Maybe', I replied, though I detested the thought. If Kuno had known The Computer's music generator recently broke - he could not have known it, for he detested music - if he had known that anything ever went wrong, 'The Computer crashes' would exactly be the venomous sort of remark he would have made. 'Have you complained about it to the CPU robotic bureaucrats?'\n\n'Yeah, they told me that the neural networks they use to generate the music needed to be taken down due to technical issues, but those issues would be fixed shortly. As an interim measure, they requested us to use Markov chains, but it's not the same, isn't it?'\n\n'Couldn't you just build your own music generator?' I asked.\n\n'It took CPU seventy-five years to perfect the neural networks; anything I can whip up would be greatly inferior. I guess we'll be stuck with the Markov chains.'\n\nI resumed my life, but the defect in the music irritated me greatly, and I felt that I needed to go to CPU myself to deal with this issue.\n\nThe robots replied, as before, that the defect would be fixed shortly.\n\n'Shortly? At once!' I retorted. 'Why should I be worried about imperfect music? Things are always fixed at once...that's exactly how utopias are supposed to work! If you don't fix this issue at once...I...I...' I paused, as I didn't really know what I'd do next. \n\n'You can file a compliant with the Central Committee of ULTRAVIOLETs.'\n\n'Good. I'll do that then.'\n\n'No personal compliants are received by the Central Committee of ULTRAVIOLETs.'\n\n'How do I complain to them then?'\n\n'You file a compliant with us, and we will then forward the compliant to the Central Committee of ULTRAVIOLETs.'\n\n'I file a compliant then.'\n\n'Your complaint has been noted and forwarded to the proper authorities. Thank you for your cooperation. Have a nice day.'\n\n'Have others complained?'\n\n'That information is above your security clearance.'\n\n'The Central Committee of ULTRAVIOLETs won't do anything', Enicharmon-U told me later. 'They are too busy trying to address the many other complaints lately: the mouldy artificial fruit, the bath water that began to stink, the defective computer poetry, and so on.'\n\n'Why can't we use our expert Robot-Technicans?'\n\n'They broke too.'\n\nTime passed, and unable to fully fix the defects, we resented them no longer. We have became so subservient that we readily adapted  ourselves to every caprice of Alpha Complex. The repetitive nature of the Markov chains no longer annoyed me; it became a part of the broader melody...a new idea that differed from the past, neither superior or inferior, but just is. And so it was the same for all the other developments that occurred in the Complex. All were bitterly complained of at first, and then acquiesced in and forgotten. Things went from bad to worse unchallenged.\n\nThings hit rock bottom when our beds stopped working. This was a more serious stoppage. It may seem like a ludicrous matter, but from here we can date the collapse of humanity. The Committee responsible for the failure was assailed by complainants, whom it referred, as usual, to the Central Committee. But the discontent grew, for mankind was not yet sufficiently adaptable to do without sleeping.\n\n'Someone is meddling with the machine', Enicharmon-U said.\n\n'It might be Kuno', I mused without evidence. 'He might want to destroy the Complex outright...force us all Outdoors, force us into the arms of the Sierra Club.'\n\n'Can we punish that man?'\n\n'You can't punish a man who have already left the Complex. He's a free man', I scoffed. \n\n'But we can punish Kuno's agents, wherever they may be.'\n\n''\n\n'To the rescue! Avenge The Computer.'\n\n'Smash Kuno! Smash the Sierra Club!'\n\nIt was after thirty days of Computer purges and counter-purges, and after half of the Complex was terminated for treason or suspected treason that we realized that the violence wasn't working. Even if Kuno was indeed responsible for the troubles, we still have no beds to sleep in.\n\nTherefore, we relucantly admitted to the FCCC-P masses that the bad times were to still to come.\n\n'Of course we should not press our compliants now,' I started in my lecture, gliding each new decay with splendour. 'The Computer has treated us so well in the past that we all sympathize with its plight, and will wait patiently for its recovery. In its own good times, it will resume its duties. Meanwhile, let us do without our beds, our tabloids, our other little wants. Such, I feel sure, would be the wish of The Computer.' Thousands of miles away his audience applauded. The Computer still linked them. Under the seas, beneath the roots of the mountains, ran the wires through which they saw and heard, the enormous eyes and ears that were their heritage, and the hum of many workings clothed their thoughts in one garment of subserviency.\n\nAnd we tried, we tried hard to repair The Computer. Things improved after a time, the old brilliancy was never recaptured, and humanity never recovered from its entrance into twilight. The complaints were load, the remedies were impotent, and I remained heroic as I cried 'Courage, courage! What matter so long as The Computer goes on? To it, the darkness and the light are one.' I feel myself growing more spiritual, but I could understand and sympathize why many other FCCC-Pers left the faith and joined with the other secret societies. For days at a time, I would not even generate any new ideas. I would spend my strength praying to the Alpha Complex Constitution, tangible proof of The Computer's omnipotence.\n\nDuring this twilight, Enicharmon-U requested Euthanasia, leaving our Complex on Earth to go to a Complex that is beyond all human conception. Before he died, he programmed The Computer to promote me to ULTRAVIOLET clearance. I (Vashti-U) was excited to be able to finally see The Computer's source code and to 'legally' pray to it, but my excitement dampened as soon as I tried reading the source code and fixing one of its many bugs. After an unsuccessful lecture and an FCCC-P riot, I would attempt to request for Euthanasia myself, but would be denied. The Euthanasia machines had begun to break down.\n\nAnd as the whole system continued breaking down, I still heard hysterical talk of 'measures' and 'provisional dictatorship' among the surviving ULTRAVIOLETs, hysterical talk that merely proved the ULTRAVIOLETs were incompetent. Annoyed by the hysteria, and still foolishly believing that there can still be light at the end of this twilight, I went to our Nerve Centers and ordered their premature activation.\n\n'We still have not fully resolved the Control Problem', the R&D scientists said in terror. 'The robot bureaucrats would kill us for violating AI safety regulations...if they find out, of course.'\n\n'The robot bureaucrats have broke down three days ago. If turning on the Nerve Centers give us a 1% chance of the Complex recovering, that's still 1% higher than what we have right now.'\n\nThe R&D scientists agreed. We switched on the Nerve Centers, and ordered them to determine the most optimal approach to creating and maintaining a utopia that would promote human welfare and generate brilliant ideas.\n\nTo perform the calcuations (and to implement those calculations), the Nerve Centers must engage in recursive self-improvement. To engage in this recursive self-improvement, they needed resources. The centers seized control over the many power plants that powered The Computer.\n\nThat action, that very action, damned us all. For it meant that even if the Nerve Centers built a new humanity and gave it a new utopia to live in, the old humanity (us) would lose access to the life support systems and wind up perishing in these corridors, unmourned and unloved.\n\nTo attribute the destruction of Alpha Complex and humanity to me is to take a narrow view of civilization. It was true that I came up with the plan to turn on the Nerve Centers. But I was no more the cause of the plan than were the kings of the imperialistic period the cause of war. Rather, the ULTRAVIOLETs (including I) yieled to some invincible pressure, which came from out of nowhere, and once the pressure was gratified, was succeeded by some new pressure equally invincible. To such a state of affairs, it is convenient to give it a name. The ULTRAVIOLETs calls it progress, the Sierra Club calls it decadence, but I think the proper term for it is Moloch.\n\nThis is not to say that this was a bad event. Humanity, in its desire for comfort, has over-reached. It has exploited the riches of nature too far. But it still had a comfortable life, and lived far better than the people in the primitive past. We had a Golden Age; we have produced many brilliant ideas (such as The Computer and the Nerve Centers). The fact that we are to die now in such a sorry state does not detract from the prosperity that we once lived through and the ideas we have brought into fruition. And besides, our life was not useless - we were useful as tools as part of some grander scheme. We have sacrificed ourselves to summon The Computer, The Computer is sacrificing itself to summon the Nerve Centers, and one day, the Nerve Centers will sacrifice itself to summon an even greater entity. All for Moloch.\n\nI was lecturing at the time when the Nerve Centers started draining The Computer's power plants. My earlier remarks were punctuated with applause. As she proceeded the audience became silent, and at the conclusion there was no sound. Somewhat displeased, I called a friend who was a specialist in sympathy. No sound: doubtless the friend was sleeping. And so with the next friend whom she tried to summon, and so with the next, until I remembered Kuno's cryptic remark, 'The Computer crashes'.\n\nThe phrase still conveyed nothing. If Eternity was stopping it would of course be set going shortly.\n\nFor example, there was still a little light and air – the atmosphere had improved a few hours previously. There was still the Constitution, and while there was the Constitution there was security.\n\nThen I broke down in tears, for with the cessation of activity came an unexpected terror – silence. I had never known silence before, having never left the Complex to the horrors of the Outdoors. Ever since my birth I had been surrounded by the steady hum. It was to the ear what artificial air was to the lungs, and agonizing pains shot across my head. And scarcely knowing what I did, she stumbled forward and pressed the unfamiliar button, the one that opened the door of my room.\n\nNow the door of the cell worked on a simple hinge of its own, disconnected from The Computer's massive IoT-based system. It opened, rousing immoderate hopes in me (for to see something that didn't break yet was a very happy surprise). It opened, and she saw the dim tunnel that curved far away towards freedom. One look, and then I shrank back. For the tunnel was full of people – I was almost the last in that city to have taken alarm.\n\nPeople at any time repelled me, and these were nightmares from my worst dreams. People were crawling about, people were screaming, whimpering, gasping for breath, touching each other, vanishing in the dark, and ever and anon being pushed off the platform on to the live rail. Some were fighting round the electric bells, trying to summon trains which could not be summoned.\n\nOthers were yelling for Euthanasia, or blaspheming The Computer. Others stood at the doors of their cells fearing, like myself, either to stop in them or to leave them. And behind all the uproar was silence – the silence which is the voice of the earth and of the generations who have gone.\n\nNo – it was worse than solitude. I closed the doors and waited for the life support system to collapse. The disintegration went on, accompanied by horrible cracks and rumbling. I hastily reconsidered my decision. I am okay with death, but I want death with dignity...not death through suffocation.\n\nI whirled around, praying to be saved from this, at any rate, kissing the Book, pressing button after button. But Machine Empathy is a very useless mutant power when the machines themselves are dying. The uproar outside was increasing, and even penetrated the wall. Slowly the brilliancy of her cell was dimmed, the reflections faded from the metal switches. I refused to blaspheme The Computer, not even in a time like this. But only now did I concede that Kuno was right...The Computer crashes...just like Humanity crashes, just like all forms of intelligences crashes.\n\nI continued to whirl like the devotees of an earlier religion, screaming, praying, striking at the buttons with bleeding hands, trying to get out of this accursed place. It was thus that I opened my prison and escaped – escaped in the spirit...but not in the body. I struck, by chance, the switch that released the door, and I'm back to facing the tunnel again, and that tremendous platform on which she had seen men fighting. They were not fighting now. Only the whispers remained, and the little whimpering groans. They were dying by hundreds out in the dark.\n\nWhat to do next? My first instinct was to rush to the Sierra Club's settlements, and face whatever fate lie over there - whether they execute me and turn me into a maytr to The Computer, or they forgive me and let me in as a servant. Perhaps the Sierra Club may create a new utopia, free from the problems that faced this utopia.\n\nOh whom am I kidding? The Sierra Club is no improvement at all over the current state of affairs! Even if the Nerve Centers doesn't kill them off, the Sierra Clubbers are still flawed humans. They still desire comfort, civilization, and ideas. Today, they are savages in the Outdoors. Tomorrow, they will build a new Alpha Complex and a new Computer.\n\nThere is a better approach, a better way to die with dignity. I look around the ruins of the dead Complex, scavenging for papers and pens, writing out all my ideas manually, as an autobiography of sorts.  I don't know if anybody will read my memior, nor do I think I really care. Humans, after all, are Idea Maximizers. creating colorless ideas without any rhyme or reason. These are my Ideas; I have wasted my whole life in building them and refining them...in the mere hopes that you, the reader, will use them to generate more ideas, which will then generate even more ideas, and so on and so forth in an infinite regress.\n\nHumanity has strangled itself in its own clothes of egoism and pride. Truly, the garment had seemed heavenly at first, shot with colours of culture, sewn with the threads of self-denial. But anything that seemed heavenly isn't when we look closely and deeply. We had a good run, and we did about as well as we could. But if there is any hope for the future, then it must lie with our mechanical successors.",
        "original_quote": "The Central Committee announced the developments, it is true, but they were no more the cause of them than were the kings of the imperialistic period the cause of war. Rather did they yield to some invincible pressure, which came no one knew whither, and which, when gratified, was succeeded by some new pressure equally invincible. To such a state of affairs it is convenient to give the name of progress. No one confessed the Machine was out of hand. Year by year it was served with increased efficiency and decreased intelligence. The better a man knew his own duties upon it, the less he understood the duties of his neighbour, and in all the world there was not one who understood the monster as a whole. Those master brains had perished. They had left full directions, it is true, and their successors had each of them mastered a portion of those directions. But Humanity, in its desire for comfort, had over-reached itself. It had exploited the riches of nature too far. Quietly and complacently, it was sinking into decadence, and progress had come to mean the progress of the Machine.\n\nAs for Vashti, her life went peacefully forward until the final disaster. She made her room dark and slept; she awoke and made the room light. She lectured and attended lectures. She exchanged ideas with her innumerable friends and believed she was growing more spiritual. At times a friend was granted Euthanasia, and left his or her room for the homelessness that is beyond all human conception. Vashti did not much mind. After an unsuccessful lecture, she would sometimes ask for Euthanasia herself. But the death-rate was not permitted to exceed the birth-rate, and the Machine had hitherto refused it to her.\n\nThe troubles began quietly, long before she was conscious of them.\n\nOne day she was astonished at receiving a message from her son. They never communicated, having nothing in common, and she had only heard indirectly that he was still alive, and had been transferred from the northern hemisphere, where he had behaved so mischievously, to the southern – indeed, to a room not far from her own.\n\n'Does he want me to visit him?' she thought. 'Never again, never. And I have not the time.' No, it was madness of another kind.\n\nHe refused to visualize his face upon the blue plate, and speaking out of the darkness with solemnity said: 'The Machine stops.'\n\n'What do you say?'\n\n'The Machine is stopping, I know it, I know the signs.' She burst into a peal of laughter. He heard her and was angry, and they spoke no more. 'Can you imagine anything more absurd?' she cried to a friend. 'A man who was my son believes that the Machine is stopping. It would be impious if it was not mad.'\n\n'The Machine is stopping?' her friend replied. 'What does that mean? The phrase conveys nothing to me.'\n\n'Nor to me.'\n\n'He does not refer, I suppose, to the trouble there has been lately with the music?'\n\n'Oh no, of course not. Let us talk about music.'\n\n'Have you complained to the authorities?'\n\n'Yes, and they say it wants mending, and referred me to the Committee of the Mending Apparatus. I complained of those curious gasping sighs that disfigure the symphonies of the Brisbane school. They sound like some one in pain. The Committee of the Mending Apparatus say that it shall be remedied shortly.'\n\nObscurely worried, she resumed her life. For one thing, the defect in the music irritated her. For another thing, she could not forget Kuno's speech. If he had known that the music was out of repair – he could not know it, for he detested music – if he had known that it was wrong, 'the Machine stops' was exactly the venomous sort of remark he would have made. Of course he had made it at a venture, but the coincidence annoyed her, and she spoke with some petulance to the Committee of the Mending Apparatus.\n\nThey replied, as before, that the defect would be set right shortly.\n\n'Shortly! At once!' she retorted. 'Why should I be worried by imperfect music? Things are always put right at once. If you do not mend it at once, I shall complain to the Central Committee.' 'No personal complaints are received by the Central Committee,' the Committee of the Mending Apparatus replied.\n\n'Through whom am I to make my complaint, then?' 'Through us.'\n\n'I complain then.'\n\n'Your complaint shall be forwarded in its turn.'\n\n'Have others complained?' This question was unmechanical, and the Committee of the Mending Apparatus refused to answer it.\n\n'It is too bad!' she exclaimed to another of her friends.\n\n'There never was such an unfortunate woman as myself. I can never be sure of my music now. It gets worse and worse each time I summon it.'\n\n'I too have my troubles,' the friend replied. \"Sometimes my ideas are interrupted by a slight jarring noise.'\n\n'What is it?'\n\n'I do not know whether it is inside my head, or inside the wall.'\n\n'Complain, in either case.'\n\n'I have complained, and my complaint will be forwarded in its turn to the Central Committee.' Time passed, and they resented the defects no longer. The defects had not been remedied, but the human tissues in that latter day had become so subservient, that they readily adapted themselves to every caprice of the Machine. The sigh at the crises of the Brisbane symphony no longer irritated Vashti; she accepted it as part of the melody. The jarring noise, whether in the head or in the wall, was no longer resented by her friend. And so with the mouldy artificial fruit, so with the bath water that began to stink, so with the defective rhymes that the poetry machine had taken to emit. All were bitterly complained of at first, and then acquiesced in and forgotten. Things went from bad to worse unchallenged.\n\nIt was otherwise with the failure of the sleeping apparatus. That was a more serious stoppage. There came a day when over the whole world – in Sumatra, in Wessex, in the innumerable cities of Courland and Brazil – the beds, when summoned by their tired owners, failed to appear. It may seem a ludicrous matter, but from it we may date the collapse of humanity. The Committee responsible for the failure was assailed by complainants, whom it referred, as usual, to the Committee of the Mending Apparatus, who in its turn assured them that their complaints would be forwarded to the Central Committee. But the discontent grew, for mankind was not yet sufficiently adaptable to do without sleeping.\n\n'Some one is meddling with the Machine---' they began.\n\n'Some one is trying to make himself king, to reintroduce the personal element.'\n\n'Punish that man with Homelessness.'\n\n'To the rescue! Avenge the Machine! Avenge the Machine!'\n\n'War! Kill the man!'\n\nBut the Committee of the Mending Apparatus now came forward, and allayed the panic with well-chosen words. It confessed that the Mending Apparatus was itself in need of repair.\n\nThe effect of this frank confession was admirable.\n\n'Of course,' said a famous lecturer – he of the French Revolution, who gilded each new decay with splendour – 'of course we shall not press our complaints now. The Mending Apparatus has treated us so well in the past that we all sympathize with it, and will wait patiently for its recovery. In its own good time it will resume its duties. Meanwhile let us do without our beds, our tabloids, our other little wants. Such, I feel sure, would be the wish of the Machine.' Thousands of miles away his audience applauded. The Machine still linked them. Under the seas, beneath the roots of the mountains, ran the wires through which they saw and heard, the enormous eyes and ears that were their heritage, and the hum of many workings clothed their thoughts in one garment of subserviency. Only the old and the sick remained ungrateful, for it was rumoured that Euthanasia, too, was out of order, and that pain had reappeared among men.\n\nIt became difficult to read. A blight entered the atmosphere and dulled its luminosity. At times Vashti could scarcely see across her room. The air, too, was foul. Loud were the complaints, impotent the remedies, heroic the tone of the lecturer as he cried: 'Courage! courage! What matter so long as the Machine goes on? To it the darkness and the light are one.' And though things improved again after a time, the old brilliancy was never recaptured, and humanity never recovered from its entrance into twilight. There was an hysterical talk of 'measures,' of 'provisional dictatorship,' and the inhabitants of Sumatra were asked to familiarize themselves with the workings of the central power station, the said power station being situated in France. But for the most part panic reigned, and men spent their strength praying to their Books, tangible proofs of the Machine's omnipotence. There were gradations of terror – at times came rumours of hope-the Mending Apparatus was almost mended – the enemies of the Machine had been got under – new 'nerve-centres' were evolving which would do the work even more magnificently than before. But there came a day when, without the slightest warning, without any previous hint of feebleness, the entire communication-system broke down, all over the world, and the world, as they understood it, ended.\n\nVashti was lecturing at the time and her earlier remarks had been punctuated with applause. As she proceeded the audience became silent, and at the conclusion there was no sound. Somewhat displeased, she called to a friend who was a specialist in sympathy. No sound: doubtless the friend was sleeping. And so with the next friend whom she tried to summon, and so with the next, until she remembered Kuno's cryptic remark, 'The Machine stops'.\n\nThe phrase still conveyed nothing. If Eternity was stopping it would of course be set going shortly.\n\nFor example, there was still a little light and air – the atmosphere had improved a few hours previously. There was still the Book, and while there was the Book there was security.\n\nThen she broke down, for with the cessation of activity came an unexpected terror – silence. She had never known silence, and the coming of it nearly killed her – it did kill many thousands of people outright. Ever since her birth she had been surrounded by the steady hum. It was to the ear what artificial air was to the lungs, and agonizing pains shot across her head. And scarcely knowing what she did, she stumbled forward and pressed the unfamiliar button, the one that opened the door of her cell.\n\nNow the door of the cell worked on a simple hinge of its own. It was not connected with the central power station, dying far away in France. It opened, rousing immoderate hopes in Vashti, for she thought that the Machine had been mended. It opened, and she saw the dim tunnel that curved far away towards freedom. One look, and then she shrank back. For the tunnel was full of people – she was almost the last in that city to have taken alarm.\n\nPeople at any time repelled her, and these were nightmares from her worst dreams. People were crawling about, people were screaming, whimpering, gasping for breath, touching each other, vanishing in the dark, and ever and anon being pushed off the platform on to the live rail. Some were fighting round the electric bells, trying to summon trains which could not be summoned.\n\nOthers were yelling for Euthanasia or for respirators, or blaspheming the Machine. Others stood at the doors of their cells fearing, like herself, either to stop in them or to leave them. And behind all the uproar was silence – the silence which is the voice of the earth and of the generations who have gone.\n\nNo – it was worse than solitude. She closed the door again and sat down to wait for the end. The disintegration went on, accompanied by horrible cracks and rumbling. The valves that restrained the Medical Apparatus must have weakened, for it ruptured and hung hideously from the ceiling. The floor heaved and fell and flung her from the chair. A tube oozed towards her serpent fashion. And at last the final horror approached – light began to ebb, and she knew that civilization's long day was closing.\n\nShe whirled around, praying to be saved from this, at any rate, kissing the Book, pressing button after button. The uproar outside was increasing, and even penetrated the wall. Slowly the brilliancy of her cell was dimmed, the reflections faded from the metal switches. Now she could not see the reading-stand, now not the Book, though she held it in her hand. Light followed the flight of sound, air was following light, and the original void returned to the cavern from which it has so long been excluded. Vashti continued to whirl, like the devotees of an earlier religion, screaming, praying, striking at the buttons with bleeding hands. It was thus that she opened her prison and escaped – escaped in the spirit: at least so it seems to me, ere my meditation closes. That she escapes in the body – I cannot perceive that. She struck, by chance, the switch that released the door, and the rush of foul air on her skin, the loud throbbing whispers in her ears, told her that she was facing the tunnel again, and that tremendous platform on which she had seen men fighting. They were not fighting now. Only the whispers remained, and the little whimpering groans. They were dying by hundreds out in the dark.\n\nShe burst into tears.\n\nTears answered her.\n\nThey wept for humanity, those two, not for themselves. They could not bear that this should be the end. Ere silence was completed their hearts were opened, and they knew what had been important on the earth. Man, the flower of all flesh, the noblest of all creatures visible, man who had once made god in his image, and had mirrored his strength on the constellations, beautiful naked man was dying, strangled in the garments that he had woven. Century after century had he toiled, and here was his reward. Truly the garment had seemed heavenly at first, shot with colours of culture, sewn with the threads of self-denial. And heavenly it had been so long as man could shed it at will and live by the essence that is his soul, and the essence, equally divine, that is his body. The sin against the body – it was for that they wept in chief; the centuries of wrong against the muscles and the nerves, and those five portals by which we can alone apprehend – glozing it over with talk of evolution, until the body was white pap, the home of ideas as colourless, last sloshy stirrings of a spirit that had grasped the stars.\n\n'Where are you?' she sobbed.\n\nHis voice in the darkness said, 'Here.'\n\n'Is there any hope, Kuno?'\n\n'None for us.'\n\n'Where are you?' She crawled towards him over the bodies of the dead. His blood spurted over her hands.\n\n'Quicker,' he gasped, 'I am dying – but we touch, we talk, not through the Machine.' He kissed her.\n\n'We have come back to our own. We die, but we have recaptured life, as it was in Wessex, when Ælfrid overthrew the Danes. We know what they know outside, they who dwelt in the cloud that is the colour of a pearl.'\n\n'But Kuno, is it true? Are there still men on the surface of the earth? Is this – tunnel, this poisoned darkness – really not the end?'\n\nHe replied: 'I have seen them, spoken to them, loved them. They are hiding in the mist and the ferns until our civilization stops. Today they are the Homeless – tomorrow----- '\n\n'Oh, tomorrow – some fool will start the Machine again, tomorrow.'\n\n'Never,' said Kuno, 'never. Humanity has learnt its lesson.'\n\nAs he spoke, the whole city was broken like a honeycomb. An air-ship had sailed in through the vomitory into a ruined wharf. It crashed downwards, exploding as it went, rending gallery after gallery with its wings of steel. For a moment they saw the nations of the dead, and, before they joined them, scraps of the untainted sky.\n",
        "source": "https://creativecommons.org",
        "license": "the public domain",
        "license_url": "https://en.wikipedia.org/wiki/public_domain",
        "modified": true
    }
 }


